[
    {
        "line": "WHAT MAKES A GOOD PROMPT"
    },
    {
        "line": "There can be a wide variety of prompts that you will get to know. The different types of prompts"
    },
    {
        "line": "that one can use:"
    },
    {
        "line": "Natural Language Prompts:"
    },
    {
        "line": "• These prompts emulate human-like instructions, gurgling the form of natural language"
    },
    {
        "line": "cues."
    },
    {
        "line": "• They allow developers to interact with the model more intuitively, using instructions"
    },
    {
        "line": "that resemble how a person would communicate."
    },
    {
        "line": "System Prompts:"
    },
    {
        "line": "• System prompts are predefined instructions or templates that developers provide to"
    },
    {
        "line": "guide the model's output."
    },
    {
        "line": "• They offer a structured way of specifying the desired output format or behaviour,"
    },
    {
        "line": "providing explicit instructions to the model."
    },
    {
        "line": "Conditional Prompts:"
    },
    {
        "line": "• Conditional prompts involve conditioning the model on specific contexts or constraints."
    },
    {
        "line": "• By incorporating conditional prompts, developers can guide the model's behavior"
    },
    {
        "line": "based on conditional statements, such as \"if X, then Y\" or \"Given A, generate B.\""
    },
    {
        "line": "How does Prompt Engineering Work?"
    },
    {
        "line": "• Start with a clear understanding of the task."
    },
    {
        "line": "• Use clear and concise language."
    },
    {
        "line": "• Be specific."
    },
    {
        "line": "• Use examples."
    },
    {
        "line": "• Experiment."
    },
    {
        "line": "Benefits of Prompt Engineering"
    },
    {
        "line": "• Question answering."
    },
    {
        "line": "• Creative writing."
    },
    {
        "line": "• Machine translation."
    },
    {
        "line": "• Coding."
    },
    {
        "line": "Specifications to Definitely Include in an Effective Prompt"
    },
    {
        "line": "To create the \"best\" prompt, experts consistently emphasize the following must-have elements:"
    },
    {
        "line": "1. Clear Goal: State exactly what you want the AI to achieve (e.g., explain, generate,"
    },
    {
        "line": "analyze). Ambiguity leads to vague outputs."
    },
    {
        "line": "2."
    },
    {
        "line": "Specific Role or Persona: Assign the AI a role (e.g., “act as a physicist”) to anchor its"
    },
    {
        "line": "tone, expertise, and perspective."
    },
    {
        "line": "3."
    },
    {
        "line": "Detailed Context: Provide background information relevant to the task so the AI doesn’t"
    },
    {
        "line": "guess or misinterpret your intent."
    },
    {
        "line": "4."
    },
    {
        "line": "Output Format: Define how the response should be structured (e.g., list, essay, table)"
    },
    {
        "line": "to match your needs."
    },
    {
        "line": "5."
    },
    {
        "line": "Constraints or Guardrails: Specify what to avoid (e.g., “no technical jargon”) or limits"
    },
    {
        "line": "(e.g., “under 200 words”) to refine the output."
    },
    {
        "line": "6."
    },
    {
        "line": "Tone and Style: Indicate the desired voice (e.g., formal, casual, persuasive) to align"
    },
    {
        "line": "with your audience or purpose."
    },
    {
        "line": "These elements ensure the AI has a roadmap to follow, reducing misinterpretation and"
    },
    {
        "line": "maximizing relevance."
    },
    {
        "line": "Detailed Outline for Writing an Effective Prompt"
    },
    {
        "line": "Here’s a step-by-step outline, grounded in expert-recommended techniques (e.g., OpenAI’s"
    },
    {
        "line": "prompt engineering guides, the CLEAR framework by Dr. Leo Lo, and practical frameworks like"
    },
    {
        "line": "RTF or CRAFT), to craft a prompt that an AI like ChatGPT will understand and use to output"
    },
    {
        "line": "exactly what you want:"
    },
    {
        "line": "1. Define the Goal"
    },
    {
        "line": "● What to Do: Explicitly state the objective of the prompt. This is the “why” behind your"
    },
    {
        "line": "request."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: Without a clear goal, the AI may provide generic or off-target"
    },
    {
        "line": "responses."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: Use action verbs (e.g., “explain,” “generate,” “compare”) and a"
    },
    {
        "line": "concise purpose."
    },
    {
        "line": "●"
    },
    {
        "line": "Example: “Generate a marketing plan” or “Explain quantum physics concepts.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Ask yourself, “What’s the one thing I need from this response?”"
    },
    {
        "line": "2. Assign a Role or Persona"
    },
    {
        "line": "● What to Do: Tell the AI who it should “be” while responding (e.g., “You are a seasoned"
    },
    {
        "line": "chef” or “Act as a data analyst”)."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: This taps into the model’s training to mimic specific expertise or"
    },
    {
        "line": "perspectives, improving accuracy and tone."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: Start with a declarative statement assigning the role before the"
    },
    {
        "line": "task."
    },
    {
        "line": "●"
    },
    {
        "line": "Example: “You are an experienced SEO strategist.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Choose a role that matches the domain knowledge required for your goal."
    },
    {
        "line": "3. Provide Context"
    },
    {
        "line": "● What to Do: Give relevant background details to frame the task (e.g., audience,"
    },
    {
        "line": "scenario, or prior information)."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: Context prevents the AI from making assumptions or missing key"
    },
    {
        "line": "nuances."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: Include 1–2 sentences of specifics—dates, locations, stakeholders,"
    },
    {
        "line": "or constraints."
    },
    {
        "line": "●"
    },
    {
        "line": "Example: “The marketing plan is for a tech startup launching a new app in 2025,"
    },
    {
        "line": "targeting young professionals.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Imagine explaining the task to a smart colleague who lacks your specific situation—"
    },
    {
        "line": "what would they need to know?"
    },
    {
        "line": "4. Specify the Task"
    },
    {
        "line": "● What to Do: Detail the exact action or deliverable you want, breaking it into clear steps if"
    },
    {
        "line": "complex."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: Precision here ensures the AI focuses on your request, not tangents."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: Use direct instructions and, if needed, list subtasks (e.g., “Include"
    },
    {
        "line": "X, Y, Z”)."
    },
    {
        "line": "●"
    },
    {
        "line": "Example: “Write a 200-word blog post with three tips for app promotion, each with a"
    },
    {
        "line": "catchy headline and a brief rationale.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Avoid vague terms like “talk about” — opt for “list,” “describe,” or “analyze” instead."
    },
    {
        "line": "5. Set the Output Format"
    },
    {
        "line": "● What to Do: Define how the response should look (e.g., bullet points, paragraphs, code"
    },
    {
        "line": "block, table)."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: This tailors the structure to your use case, making the output"
    },
    {
        "line": "immediately usable."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: State the format explicitly, including length if relevant."
    },
    {
        "line": "●"
    },
    {
        "line": "Example: “Provide the response as a numbered list with each tip in 50 words or less.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Match the format to how you’ll use it (e.g., a table for data comparison, prose for a"
    },
    {
        "line": "narrative)."
    },
    {
        "line": "6. Add Constraints and Guardrails"
    },
    {
        "line": "● What to Do: Note what to avoid or include to refine the scope (e.g., “No sales jargon” or"
    },
    {
        "line": "“Use only 2025 data”)."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: This prevents irrelevant or unwanted content, keeping the AI on track."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: Use phrases like “do not,” “only include,” or “limit to.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Example: “Do not mention competitors by name; focus on general strategies.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Anticipate common AI pitfalls (e.g., hallucination, verbosity) and preempt them."
    },
    {
        "line": "7. Specify Tone and Style"
    },
    {
        "line": "● What to Do: Indicate the desired voice or complexity (e.g., “friendly and casual” or"
    },
    {
        "line": "“technical and concise”)."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: This ensures the response fits your audience or purpose, enhancing its"
    },
    {
        "line": "effectiveness."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: Add a short descriptor after the task."
    },
    {
        "line": "●"
    },
    {
        "line": "Example: “Explain it in a supportive tone, as if speaking to a beginner.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Test with adjectives like “professional,” “witty,” or “simple” to see what works best."
    },
    {
        "line": "8. Include Examples (Optional but Powerful)"
    },
    {
        "line": "● What to Do: Provide a sample input/output pair to show the AI what success looks like."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: Examples clarify expectations, especially for creative or nuanced tasks,"
    },
    {
        "line": "leveraging few-shot learning."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: Add “For example: [input] → [desired output].”"
    },
    {
        "line": "●"
    },
    {
        "line": "Example: “For example: ‘Tip 1: Host a giveaway’ → ‘Tip 1: Host a Giveaway - Boost"
    },
    {
        "line": "engagement with a fun contest.’”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Use this for complex tasks or when prior outputs missed the mark."
    },
    {
        "line": "9. Encourage Reasoning (Optional for Precision)"
    },
    {
        "line": "● What to Do: Ask the AI to explain its logic or steps (e.g., “Show your reasoning”)."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: This reduces errors and lets you verify the response’s validity."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: Add a phrase like “step-by-step” or “justify your answer.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Example: “List three strategies and explain why each works for this audience.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Useful for technical or analytical tasks where process matters."
    },
    {
        "line": "10. Test and Refine"
    },
    {
        "line": "● What to Do: Review the AI’s output and tweak the prompt if it’s off-target (e.g., add"
    },
    {
        "line": "detail, adjust tone)."
    },
    {
        "line": "●"
    },
    {
        "line": "Why It Matters: LLMs aren’t perfect; iterative refinement hones the result."
    },
    {
        "line": "●"
    },
    {
        "line": "How to Implement: Run the prompt, then modify based on gaps (e.g., “Make it shorter”"
    },
    {
        "line": "or “Add more detail”)."
    },
    {
        "line": "●"
    },
    {
        "line": "Example: If the blog post is too long, add “Keep each tip under 50 words.”"
    },
    {
        "line": "●"
    },
    {
        "line": "Tip: Treat prompting like a conversation—adjust based on what you get back."
    },
    {
        "line": "To ensure PromptAI generates prompts that are both speciﬁc and comprehensive, you"
    },
    {
        "line": "can implement the following strategies:"
    },
    {
        "line": "Implement a Multi-Step Prompt Generation Process"
    },
    {
        "line": "1. Input Analysis:"
    },
    {
        "line": "● Parse user input for key details, intent, and context12."
    },
    {
        "line": "● Use NLP techniques to extract essential information from minimal user"
    },
    {
        "line": "input."
    },
    {
        "line": "2. Prompt Structuring:"
    },
    {
        "line": "● Utilize templates or modular designs for common prompt structures2."
    },
    {
        "line": "● Include sections for task description, context, constraints, and desired"
    },
    {
        "line": "output format."
    },
    {
        "line": "3. Detail Expansion:"
    },
    {
        "line": "● Employ a question-asking mechanism to elicit more information from the"
    },
    {
        "line": "user2."
    },
    {
        "line": "● Use this additional information to ﬂesh out the prompt with relevant"
    },
    {
        "line": "details."
    },
    {
        "line": "Incorporate Best Practices for Prompt Engineering"
    },
    {
        "line": "1. Speciﬁcity:"
    },
    {
        "line": "● Clearly deﬁne the task, target audience, tone, and key points13."
    },
    {
        "line": "● Avoid vague or open-ended requests."
    },
    {
        "line": "2. Context Provision:"
    },
    {
        "line": "● Include background information relevant to the task23."
    },
    {
        "line": "● Specify any particular requirements or constraints."
    },
    {
        "line": "3. Audience Consideration:"
    },
    {
        "line": "● Integrate the intended audience into the prompt2."
    },
    {
        "line": "● Tailor the language and complexity to the target demographic."
    },
    {
        "line": "4. Format Speciﬁcation:"
    },
    {
        "line": "● Clearly outline the desired output format3."
    },
    {
        "line": "● Include examples or templates when necessary."
    },
    {
        "line": "Implement Refinement Mechanisms"
    },
    {
        "line": "1. Iterative Improvement:"
    },
    {
        "line": "● Allow users to provide feedback on generated prompts2."
    },
    {
        "line": "● Use this feedback to reﬁne and improve the prompt."
    },
    {
        "line": "2. AI-Assisted Reﬁnement:"
    },
    {
        "line": "● Utilize the AI itself to suggest improvements or ask clarifying questions2."
    },
    {
        "line": "● Implement a self-reﬁnement process where the AI critiques and enhances"
    },
    {
        "line": "its own prompts."
    },
    {
        "line": "3. Avoid Common Mistakes:"
    },
    {
        "line": "● Guard against over-complication by breaking down complex tasks into"
    },
    {
        "line": "smaller, manageable prompts2."
    },
    {
        "line": "● Prevent under-speciﬁcation by ensuring all necessary details are included."
    },
    {
        "line": "By implementing these strategies, PromptAI can generate prompts that are both"
    },
    {
        "line": "speciﬁc to the user's needs and comprehensive in their coverage of the required"
    },
    {
        "line": "information, resulting in more effective and tailored outputs from AI models."
    },
    {
        "line": "Based on the latest best practices for structuring AI prompts, here are the key strategies to"
    },
    {
        "line": "ensure effective communication with AI models:"
    },
    {
        "line": "Clarity and Specificity"
    },
    {
        "line": "1. Provide clear and detailed instructions23."
    },
    {
        "line": "2. Be as specific as possible to minimize ambiguity5."
    },
    {
        "line": "3. Use natural language that mimics everyday speech3."
    },
    {
        "line": "4. Keep prompts concise and straightforward while including necessary details36."
    },
    {
        "line": "Context and Format"
    },
    {
        "line": "1. Add contextual information to help the AI understand the framework12."
    },
    {
        "line": "2. Specify the desired output format or presentation style4."
    },
    {
        "line": "3. Assign a role to the AI to tailor its response (e.g., \"Act as if you are...\")4."
    },
    {
        "line": "4. Include relevant background information or constraints1."
    },
    {
        "line": "Structure and Components"
    },
    {
        "line": "1. Use a structured template that includes objective, persona, and instructions2."
    },
    {
        "line": "2. Break down complex tasks into smaller, manageable prompts26."
    },
    {
        "line": "3. Utilize \"do\" and \"don't\" statements to clarify expectations4."
    },
    {
        "line": "4. Specify the tone and target audience for the response4."
    },
    {
        "line": "Examples and Iteration"
    },
    {
        "line": "1. Provide few-shot examples to guide the AI's response25."
    },
    {
        "line": "2. Use prompt chaining to build on previous responses and explore related concepts6."
    },
    {
        "line": "3. Implement sequential prompting for complex tasks or to refine information1."
    },
    {
        "line": "4. Iterate and experiment with different phrasings to improve results37."
    },
    {
        "line": "Advanced Techniques"
    },
    {
        "line": "1. Leverage the AI's implicit knowledge base for more insightful responses1."
    },
    {
        "line": "2. Use system instructions to set overall behavior or constraints2."
    },
    {
        "line": "3. Instruct the model to explain its reasoning for more transparent outputs2."
    },
    {
        "line": "4. Experiment with parameter values to fine-tune responses2."
    },
    {
        "line": "By implementing these best practices, you can create well-structured prompts that lead to more"
    },
    {
        "line": "accurate, relevant, and useful AI-generated responses."
    },
    {
        "line": "Citations:"
    },
    {
        "line": "1. https://www.codecademy.com/article/ai-prompting-best-practices"
    },
    {
        "line": "2. https://cloud.google.com/vertex-ai/generative-ai/docs/learn/prompts/prompt-design-strate"
    },
    {
        "line": "gies"
    },
    {
        "line": "3. https://www.atlassian.com/blog/artificial-intelligence/ultimate-guide-writing-ai-prompts"
    },
    {
        "line": "4. https://www.huit.harvard.edu/news/ai-prompts"
    },
    {
        "line": "5. https://www.digitalocean.com/resources/articles/prompt-engineering-best-practices"
    },
    {
        "line": "6. https://www.atlassian.com/blog/announcements/best-practices-for-generating-ai-prompts"
    },
    {
        "line": "7. https://mitsloanedtech.mit.edu/ai/basics/effective-prompts/"
    },
    {
        "line": "8. https://help.openai.com/en/articles/6654000-best-practices-for-prompt-engineering-with-t"
    },
    {
        "line": "he-openai-api"
    },
    {
        "line": "To ensure your AI prompts are specific enough to avoid generic responses, follow these key"
    },
    {
        "line": "strategies:"
    },
    {
        "line": "1. Be clear and detailed in your instructions. Instead of broad requests, provide precise"
    },
    {
        "line": "information about what you need12. For example, replace \"Tell me about oceans\" with"
    },
    {
        "line": "\"Provide an overview of the major oceans of the world and their unique characteristics.\""
    },
    {
        "line": "2. Include relevant context and background information. This helps the AI understand the"
    },
    {
        "line": "framework within which to generate its response12. For instance, when asking for"
    },
    {
        "line": "recommendations, mention your preferences and constraints."
    },
    {
        "line": "3. Use descriptive language and specific examples to create a clear picture of what you"
    },
    {
        "line": "want2. This helps the AI understand the exact tone, style, and content you desire."
    },
    {
        "line": "4. Specify the desired output format, presentation style, or structure for the AI's"
    },
    {
        "line": "response34. This guides the AI to provide information in the most useful way for your"
    },
    {
        "line": "needs."
    },
    {
        "line": "5. Break down complex tasks into smaller, more manageable prompts3. This allows you to"
    },
    {
        "line": "focus on specific aspects and get more detailed responses."
    },
    {
        "line": "6. Add constraints to your prompts, such as word counts or tone requirements3. This helps"
    },
    {
        "line": "focus the AI's output and avoid responses that are too long, short, or vague."
    },
    {
        "line": "7. Use active language and specific action verbs to clarify your intent4. For example, use"
    },
    {
        "line": "verbs like \"analyze,\" \"compare,\" or \"evaluate\" for tasks involving data interpretation."
    },
    {
        "line": "8. Provide examples or templates of the type of response you're looking for, especially for"
    },
    {
        "line": "complex or nuanced tasks34."
    },
    {
        "line": "9. Avoid using pronouns without clear antecedents, and address potential areas of"
    },
    {
        "line": "misunderstanding directly in your prompt2."
    },
    {
        "line": "10. Iterate and refine your prompts if you don't get the desired result initially5. You can ask"
    },
    {
        "line": "for improvements or rephrase your request to get more accurate and relevant"
    },
    {
        "line": "responses."
    },
    {
        "line": "By implementing these strategies, you can craft prompts that are specific, clear, and effective in"
    },
    {
        "line": "eliciting the desired responses from AI models."
    },
    {
        "line": "Citations:"
    },
    {
        "line": "1. https://www.codecademy.com/article/ai-prompting-best-practices"
    },
    {
        "line": "2. https://www.ai-wordsmith.com/blog/understanding-ai-prompts"
    },
    {
        "line": "3. https://www.nearpartner.com/prompt-engineering-13-tips-to-get-better-responses/"
    },
    {
        "line": "4. https://www.godofprompt.ai/blog/common-ai-prompt-mistakes-and-how-to-fix-them"
    },
    {
        "line": "5. https://www.reddit.com/r/LocalLLaMA/comments/183noze/how_can_i_eliminate_generic"
    },
    {
        "line": "_ai_responses/"
    },
    {
        "line": "6. https://community.openai.com/t/avoid-certain-responses-and-prompts-and-generate-resp"
    },
    {
        "line": "onses-as-per-my-input/642140"
    },
    {
        "line": "7. https://legal.thomsonreuters.com/blog/writing-effective-legal-ai-prompts/"
    },
    {
        "line": "8. https://community.openai.com/t/how-to-prevent-chatgpt-from-answering-questions-that-a"
    },
    {
        "line": "re-outside-the-scope-of-the-provided-context-in-the-system-role-message/112027"
    },
    {
        "line": "Here are some examples of effective AI prompts:"
    },
    {
        "line": "1. Task-specific prompts:"
    },
    {
        "line": "○ \"Write an email to [contact] to schedule a meeting on [day]. Use less than 200"
    },
    {
        "line": "words.\"1"
    },
    {
        "line": "○ \"Summarize these articles: [insert URLs]. Contextualize why these"
    },
    {
        "line": "announcements are important to [industry].\"1"
    },
    {
        "line": "2. Role-based prompts:"
    },
    {
        "line": "○ \"Act as if you are my personal trainer. Create a recipe that will help me refuel"
    },
    {
        "line": "after my workout. Do include tomatoes, chicken, and some type of carb. Don't"
    },
    {
        "line": "include chili peppers or any ingredients containing wheat.\"2"
    },
    {
        "line": "3. Output format specification:"
    },
    {
        "line": "○ \"Create a [format of output] about / that contains...\"2"
    },
    {
        "line": "○ \"Present this in the form of...\"2"
    },
    {
        "line": "4. Tone and audience consideration:"
    },
    {
        "line": "○ \"Give me ideas for a best man's speech that is funny and heartwarming but"
    },
    {
        "line": "appropriate for a family audience\"2"
    },
    {
        "line": "5. Creative writing prompts:"
    },
    {
        "line": "○ \"Write a short story about two students trapped in a haunted house in Montana.\"3"
    },
    {
        "line": "○ \"You're a time traveler from the year 4055. Write a letter to your past self"
    },
    {
        "line": "describing the future.\"3"
    },
    {
        "line": "6. Educational prompts:"
    },
    {
        "line": "○ \"Design a lesson plan that helps students practice multiplication tables. Make it"
    },
    {
        "line": "fun and engaging.\"3"
    },
    {
        "line": "○ \"Write a script for an educational video that explores the Solar System and its"
    },
    {
        "line": "role in the Milky Way.\"3"
    },
    {
        "line": "7. Marketing and design prompts:"
    },
    {
        "line": "○ \"Design an eye-catching logo for a sunglasses company that mixes fashion and"
    },
    {
        "line": "fun.\"3"
    },
    {
        "line": "○ \"Generate a visually appealing poster promoting a conference for chefs and"
    },
    {
        "line": "culinary artists.\"3"
    },
    {
        "line": "8. AI art prompts:"
    },
    {
        "line": "○ \"Create an abstract painting inspired by the rush hour traffic in New York City.\"3"
    },
    {
        "line": "○ \"Generate a piece of artwork with cinematic lighting that shows an actor on a"
    },
    {
        "line": "Broadway stage.\"3"
    },
    {
        "line": "These examples demonstrate how to craft specific, detailed prompts that provide clear"
    },
    {
        "line": "instructions, context, and desired outcomes to AI models, resulting in more accurate and"
    },
    {
        "line": "relevant responses."
    },
    {
        "line": "Citations:"
    },
    {
        "line": "1. https://www.atlassian.com/blog/artificial-intelligence/ultimate-guide-writing-ai-prompts"
    },
    {
        "line": "2. https://www.huit.harvard.edu/news/ai-prompts"
    },
    {
        "line": "3. https://formidableforms.com/ai-prompt-examples/"
    },
    {
        "line": "4. https://oneit.charlotte.edu/2024/09/19/ai-helpful-tips-creating-effective-prompts/"
    },
    {
        "line": "5. https://mitsloanedtech.mit.edu/ai/basics/effective-prompts/"
    },
    {
        "line": "6. https://www.wordstream.com/blog/ai-prompts"
    },
    {
        "line": "7. https://www.reddit.com/r/aiArt/comments/130n3os/a_simple_guide_for_ai_prompts_for_"
    },
    {
        "line": "people_who_are/"
    },
    {
        "line": "8. https://www.vendasta.com/blog/ai-prompt-examples/"
    },
    {
        "line": "To generate prompts that elicit exactly what you want from an AI model, consider these"
    },
    {
        "line": "advanced techniques and strategies:"
    },
    {
        "line": "Structured Prompting"
    },
    {
        "line": "1. Use a clear template:"
    },
    {
        "line": "○ Instruction: Specify the task or action"
    },
    {
        "line": "○ Context: Provide relevant background"
    },
    {
        "line": "○ Input: Include specific data or text to work with"
    },
    {
        "line": "○ Output: Define the desired format or type of response"
    },
    {
        "line": "2. Implement prompt chaining:"
    },
    {
        "line": "○ Break complex tasks into a series of interconnected prompts"
    },
    {
        "line": "○ Use the output of one prompt as input for the next"
    },
    {
        "line": "Advanced Techniques"
    },
    {
        "line": "1. Chain-of-Thought (CoT) Prompting:"
    },
    {
        "line": "○ Guide the AI through a sequence of reasoning steps"
    },
    {
        "line": "○ Improves performance on complex tasks like math problems and logical"
    },
    {
        "line": "reasoning1"
    },
    {
        "line": "2. Tree-of-Thoughts (ToT):"
    },
    {
        "line": "○ Instruct the AI to explore multiple problem-solving avenues"
    },
    {
        "line": "○ Useful for tasks requiring branching logic or decision-making4"
    },
    {
        "line": "3. Self-Consistency:"
    },
    {
        "line": "○ Generate multiple responses and select the most consistent one"
    },
    {
        "line": "○ Enhances reliability for tasks with potential variability2"
    },
    {
        "line": "4. Active Prompting:"
    },
    {
        "line": "○ Use uncertainty-based active learning to adapt LLMs to different tasks"
    },
    {
        "line": "○ Involves four stages: uncertainty estimation, selection, annotation, and"
    },
    {
        "line": "inference2"
    },
    {
        "line": "5. Generate Knowledge Prompting:"
    },
    {
        "line": "○ Instruct the AI to generate relevant facts or context before completing the main"
    },
    {
        "line": "task"
    },
    {
        "line": "○ Improves performance on knowledge-intensive tasks3"
    },
    {
        "line": "Optimization Strategies"
    },
    {
        "line": "1. Iterative Refinement:"
    },
    {
        "line": "○ Start with a basic prompt and iteratively improve it based on results"
    },
    {
        "line": "○ Use feedback loops to fine-tune the prompt's effectiveness"
    },
    {
        "line": "2. Prompt Calibration:"
    },
    {
        "line": "○ Adjust the level of detail or complexity in your prompt based on the model's"
    },
    {
        "line": "capabilities"
    },
    {
        "line": "○ Find the right balance between providing guidance and allowing the model"
    },
    {
        "line": "flexibility"
    },
    {
        "line": "3. Contextual Priming:"
    },
    {
        "line": "○ Begin with a brief, relevant scenario to set the tone and context"
    },
    {
        "line": "○ Helps align the AI's response with your specific needs"
    },
    {
        "line": "4. Explicit Constraints:"
    },
    {
        "line": "○ Clearly state any limitations or requirements"
    },
    {
        "line": "○ Use phrases like \"Do not include...\" or \"Ensure that...\""
    },
    {
        "line": "5. Meta-Prompting:"
    },
    {
        "line": "○ Instruct the AI to generate its own optimal prompt for a given task"
    },
    {
        "line": "○ Can lead to unexpected and effective prompting strategies3"
    },
    {
        "line": "By incorporating these advanced techniques and strategies, you can create more sophisticated"
    },
    {
        "line": "prompts that guide AI models to produce highly specific and tailored responses, improving the"
    },
    {
        "line": "accuracy and relevance of the output for your needs."
    },
    {
        "line": "Citations:"
    },
    {
        "line": "1. https://learnprompting.org/courses/advanced-prompt-engineering"
    },
    {
        "line": "2. https://www.mercity.ai/blog-post/advanced-prompt-engineering-techniques"
    },
    {
        "line": "3. https://www.promptingguide.ai"
    },
    {
        "line": "4. https://www.forbes.com/sites/lanceeliot/2024/05/09/the-best-prompt-engineering-techniq"
    },
    {
        "line": "ues-for-getting-the-most-out-of-generative-ai/"
    },
    {
        "line": "5. https://www.promptingguide.ai/techniques"
    },
    {
        "line": "6. https://docs.cohere.com/v2/docs/advanced-prompt-engineering-techniques"
    },
    {
        "line": "7. https://platform.openai.com/docs/guides/prompt-engineering"
    },
    {
        "line": "DATA:"
    },
    {
        "line": "1. User Input: \"Give me some AI blog ideas.\""
    },
    {
        "line": "Prompt: \"You are a technology blogger specializing in AI. Generate five"
    },
    {
        "line": "compelling blog post ideas about artificial intelligence advancements in 2025."
    },
    {
        "line": "Each idea should include a catchy headline and a short explanation (under 50"
    },
    {
        "line": "words) about its relevance. Focus on real-world applications, ethical concerns,"
    },
    {
        "line": "and industry trends. Keep the tone professional yet engaging.\""
    },
    {
        "line": "2. User Input: \"Write a poem about nature.\""
    },
    {
        "line": "Prompt: \"Compose a 12-line free-verse poem celebrating nature’s beauty. Use"
    },
    {
        "line": "vivid imagery, sensory details, and metaphors to capture the essence of a"
    },
    {
        "line": "tranquil forest at dawn. Maintain a reflective and peaceful tone.\""
    },
    {
        "line": "3. User Input: \"Explain quantum computing to me.\""
    },
    {
        "line": "Prompt: \"You are a university professor teaching quantum computing. Explain"
    },
    {
        "line": "the concept in simple terms for a beginner, using an analogy. Break down key"
    },
    {
        "line": "ideas like superposition and entanglement in under 200 words. Use a friendly"
    },
    {
        "line": "and accessible tone.\""
    },
    {
        "line": "4. User Input: \"Need a coffee shop name.\""
    },
    {
        "line": "Prompt: \"Generate 10 unique and creative coffee shop name ideas. Each name"
    },
    {
        "line": "should be short, catchy, and reflect themes of warmth, energy, and quality coffee."
    },
    {
        "line": "Avoid generic names and ensure they evoke a cozy atmosphere.\""
    },
    {
        "line": "5. User Input: \"Need a caption for a beach pic.\""
    },
    {
        "line": "Prompt: \"Write a short and engaging Instagram caption for a scenic beach"
    },
    {
        "line": "photo. Keep it under 15 words and include an optional emoji. The tone should be"
    },
    {
        "line": "fun and relaxing.\""
    },
    {
        "line": "6. User Input: \"How do I market my new product?\""
    },
    {
        "line": "Prompt: \"You are a digital marketing consultant. Develop a three-step marketing"
    },
    {
        "line": "strategy for a new fitness tracker launching in 2025. Include a short explanation"
    },
    {
        "line": "of each step, focusing on digital ads, influencer partnerships, and customer"
    },
    {
        "line": "engagement. Keep the tone professional and insightful.\""
    },
    {
        "line": "7. User Input: \"Tips for a job interview?\""
    },
    {
        "line": "Prompt: \"List five expert-backed job interview tips for first-time applicants. Keep"
    },
    {
        "line": "each tip under 30 words, ensuring they are practical and easy to apply. Focus on"
    },
    {
        "line": "confidence, preparation, and effective communication.\""
    },
    {
        "line": "8. User Input: \"Give me a sci-fi story.\""
    },
    {
        "line": "Prompt: \"Write a 300-word sci-fi short story set in a futuristic space colony where"
    },
    {
        "line": "AI controls human decisions. Include a twist ending and maintain a suspenseful"
    },
    {
        "line": "yet thought-provoking tone.\""
    },
    {
        "line": "9. User Input: \"Describe a smartwatch.\""
    },
    {
        "line": "Prompt: \"Write a compelling 100-word product description for a cutting-edge"
    },
    {
        "line": "smartwatch with AI health tracking. Highlight its key features, including heart rate"
    },
    {
        "line": "monitoring, sleep analysis, and voice control. Use an engaging and persuasive"
    },
    {
        "line": "tone.\""
    },
    {
        "line": "10. User Input: \"Give me a vegan pancake recipe.\""
    },
    {
        "line": "Prompt: \"Provide a simple and delicious vegan pancake recipe. List ingredients"
    },
    {
        "line": "and step-by-step instructions, ensuring the recipe is easy for beginners to follow."
    },
    {
        "line": "Keep it under 150 words.\""
    },
    {
        "line": "11. User Input: \"A quote for entrepreneurs.\""
    },
    {
        "line": "Prompt: \"Generate an original, inspirational quote for entrepreneurs, under 20"
    },
    {
        "line": "words, focusing on resilience and innovation.\""
    },
    {
        "line": "12. User Input: \"Tell me fun space facts.\""
    },
    {
        "line": "Prompt: \"Provide five fascinating space facts, each under 30 words, highlighting"
    },
    {
        "line": "unique celestial phenomena and recent discoveries.\""
    },
    {
        "line": "13. User Input: \"A video script on productivity.\""
    },
    {
        "line": "Prompt: \"Write a 2-minute YouTube script for a productivity tips video. Include an"
    },
    {
        "line": "engaging intro, three actionable tips, and a motivating conclusion.\""
    },
    {
        "line": "14. User Input: \"Email subject for a sale.\""
    },
    {
        "line": "Prompt: \"Generate five compelling email subject lines for a 50% off weekend"
    },
    {
        "line": "sale. Keep them under 10 words and high-converting.\""
    },
    {
        "line": "15. User Input: \"Funny birthday wish.\""
    },
    {
        "line": "Prompt: \"Write a humorous birthday message for a friend, under 30 words, using"
    },
    {
        "line": "a lighthearted joke.\""
    },
    {
        "line": "16. User Input: \"LinkedIn post on AI trends.\""
    },
    {
        "line": "Prompt: \"Craft a 200-word LinkedIn post discussing the top three AI trends for"
    },
    {
        "line": "2025. Use a professional but engaging tone.\""
    },
    {
        "line": "17. User Input: \"Slogan for an eco brand.\""
    },
    {
        "line": "Prompt: \"Create a catchy and memorable 5-word slogan for a sustainable"
    },
    {
        "line": "fashion brand.\""
    },
    {
        "line": "18. User Input: \"Write a scary story.\""
    },
    {
        "line": "Prompt: \"Write a one-paragraph horror story with an eerie twist ending. Keep it"
    },
    {
        "line": "under 100 words.\""
    },
    {
        "line": "19. User Input: \"Is AI good for healthcare?\""
    },
    {
        "line": "Prompt: \"Present three arguments in favor of AI in healthcare, each under 50"
    },
    {
        "line": "words, emphasizing efficiency, accuracy, and accessibility.\""
    },
    {
        "line": "20. User Input: \"Sort an array in Python.\""
    },
    {
        "line": "Prompt: \"Provide a Python function to sort an array in ascending order using the"
    },
    {
        "line": "bubble sort algorithm. Include comments explaining each step.\""
    },
    {
        "line": "21. User Input: \"How to learn Spanish fast?\""
    },
    {
        "line": "Prompt: \"List five practical strategies for learning Spanish quickly, each under 40"
    },
    {
        "line": "words, focusing on immersion and consistency.\""
    },
    {
        "line": "22. User Input: \"Creative wedding vows?\""
    },
    {
        "line": "Prompt: \"Write heartfelt wedding vows in 100 words, incorporating love,"
    },
    {
        "line": "commitment, and a personal touch.\""
    },
    {
        "line": "23. User Input: \"Book recommendations for self-improvement?\""
    },
    {
        "line": "Prompt: \"Suggest five self-improvement books with a one-sentence description"
    },
    {
        "line": "of each.\""
    },
    {
        "line": "24. User Input: \"Write a short mystery story.\""
    },
    {
        "line": "Prompt: \"Write a 250-word mystery story with an unexpected twist.\""
    },
    {
        "line": "25. User Input: \"Best productivity apps?\""
    },
    {
        "line": "Prompt: \"List five top-rated productivity apps and explain their key features in"
    },
    {
        "line": "under 30 words each.\""
    },
    {
        "line": "26. User Input: \"SEO tips for beginners.\""
    },
    {
        "line": "Prompt: \"Provide five essential SEO tips for beginners, each under 40 words.\""
    },
    {
        "line": "27. User Input: \"Caption for a mountain photo.\""
    },
    {
        "line": "Prompt: \"Generate a poetic 10-word Instagram caption for a scenic mountain"
    },
    {
        "line": "photo.\""
    },
    {
        "line": "28. User Input: \"Describe an enchanted forest.\""
    },
    {
        "line": "Prompt: \"Write a 150-word vivid description of an enchanted forest, using rich"
    },
    {
        "line": "imagery and sensory details.\""
    },
    {
        "line": "29. User Input: \"Create a workout routine for beginners.\""
    },
    {
        "line": "Prompt: \"Design a 3-day beginner-friendly workout plan with simple exercises"
    },
    {
        "line": "and explanations.\""
    },
    {
        "line": "30. User Input: \"Write a heartfelt apology message.\""
    },
    {
        "line": "Prompt: \"Compose a sincere 50-word apology message that expresses regret"
    },
    {
        "line": "and responsibility.\""
    },
    {
        "line": "31. User Input: \"Write a story about a haunted house.\""
    },
    {
        "line": "Prompt: \"You are a horror fiction writer. Write a short horror story (600-800"
    },
    {
        "line": "words) about a haunted house where a family moves in, only to discover its"
    },
    {
        "line": "sinister past. Develop eerie atmosphere, suspense, and a shocking revelation at"
    },
    {
        "line": "the end. Use a gothic tone and vivid descriptions to engage readers.\""
    },
    {
        "line": "32. User Input: \"Explain black holes.\""
    },
    {
        "line": "Prompt: \"You are an astrophysicist explaining black holes to a high school"
    },
    {
        "line": "audience. Define what a black hole is, how it forms, and its effects on space-time."
    },
    {
        "line": "Use simple analogies, avoid jargon, and include an example of a well-known"
    },
    {
        "line": "black hole. Keep the explanation within 300 words.\""
    },
    {
        "line": "33. User Input: \"Generate startup ideas.\""
    },
    {
        "line": "Prompt: \"You are a business consultant specializing in startups. Generate five"
    },
    {
        "line": "innovative startup ideas in the tech industry, each with a brief (50-word)"
    },
    {
        "line": "description. Focus on emerging trends like AI, sustainability, or blockchain."
    },
    {
        "line": "Ensure the ideas are feasible, unique, and have potential for market success.\""
    },
    {
        "line": "34. User Input: \"Write a motivational speech.\""
    },
    {
        "line": "Prompt: \"You are a keynote speaker at a leadership conference. Write a"
    },
    {
        "line": "3-minute motivational speech on overcoming failure and persistence. Use an"
    },
    {
        "line": "inspiring tone, include a real-life success story, and end with a call to action."
    },
    {
        "line": "Keep the speech concise, impactful, and engaging.\""
    },
    {
        "line": "35. User Input: \"Create a workout routine.\""
    },
    {
        "line": "Prompt: \"You are a professional fitness trainer. Design a 4-week"
    },
    {
        "line": "beginner-friendly home workout routine that requires no equipment. Include a"
    },
    {
        "line": "variety of exercises focusing on strength, endurance, and flexibility. Present the"
    },
    {
        "line": "routine as a structured weekly plan with a short explanation for each workout.\""
    },
    {
        "line": "36. User Input: \"Give social media tips for small businesses.\""
    },
    {
        "line": "Prompt: \"You are a digital marketing expert. Provide five actionable social media"
    },
    {
        "line": "marketing tips for small businesses to increase engagement and customer reach."
    },
    {
        "line": "Each tip should be under 50 words and should focus on cost-effective strategies"
    },
    {
        "line": "like content planning, audience targeting, and engagement.\""
    },
    {
        "line": "37. User Input: \"Describe a futuristic city.\""
    },
    {
        "line": "Prompt: \"You are a sci-fi world-builder. Describe a futuristic city in 2125,"
    },
    {
        "line": "considering advanced technology, sustainability, and social structure. Focus on"
    },
    {
        "line": "transportation, architecture, and daily life. Use vivid imagery and a balance of"
    },
    {
        "line": "utopian and dystopian elements to make the setting feel realistic.\""
    },
    {
        "line": "38. User Input: \"Make a meal plan for weight loss.\""
    },
    {
        "line": "Prompt: \"You are a certified nutritionist. Create a 7-day meal plan for weight"
    },
    {
        "line": "loss, emphasizing balanced nutrition, portion control, and variety. Each day"
    },
    {
        "line": "should include breakfast, lunch, dinner, and a healthy snack. Provide calorie"
    },
    {
        "line": "estimates and ensure meals are easy to prepare.\""
    },
    {
        "line": "39. User Input: \"Explain cryptocurrency to beginners.\""
    },
    {
        "line": "Prompt: \"You are a financial educator. Explain cryptocurrency to a beginner"
    },
    {
        "line": "audience in under 400 words. Cover what it is, how it works, and its potential"
    },
    {
        "line": "risks and benefits. Use clear, non-technical language and provide a simple"
    },
    {
        "line": "analogy to help comprehension.\""
    },
    {
        "line": "40. User Input: \"Write a character backstory.\""
    },
    {
        "line": "Prompt: \"You are a creative writing coach. Develop a detailed backstory for a"
    },
    {
        "line": "fantasy character who is a rogue mercenary with a hidden past. Include their"
    },
    {
        "line": "origins, motivations, key life events, and how they became who they are. Keep"
    },
    {
        "line": "the backstory between 500-700 words.\""
    },
    {
        "line": "41. User Input: \"List the best productivity apps.\""
    },
    {
        "line": "Prompt: \"You are a tech reviewer. List and briefly review the five best"
    },
    {
        "line": "productivity apps in 2025, considering features, usability, and effectiveness."
    },
    {
        "line": "Provide a short description (under 50 words) for each app, highlighting its"
    },
    {
        "line": "strengths and ideal user base.\""
    },
    {
        "line": "42. User Input: \"Write a mystery puzzle.\""
    },
    {
        "line": "Prompt: \"You are a game designer. Create a short interactive mystery puzzle in"
    },
    {
        "line": "which players must solve a locked-room murder case. Provide clues, red"
    },
    {
        "line": "herrings, and a logical solution. Present it in a step-by-step format so it can be"
    },
    {
        "line": "adapted into a game or escape room."
    },
    {
        "line": "43. User Input: \"Give public speaking tips.\""
    },
    {
        "line": "Prompt: \"You are a speech coach. Provide five essential public speaking tips to"
    },
    {
        "line": "help beginners improve their confidence and delivery. Keep each tip under 50"
    },
    {
        "line": "words and focus on practical, easy-to-implement strategies such as body"
    },
    {
        "line": "language, voice modulation, and audience engagement.”"
    },
    {
        "line": "44. User Input: \"Create a morning routine for success.\""
    },
    {
        "line": "Prompt: \"You are a productivity expert. Design a 60-minute morning routine that"
    },
    {
        "line": "maximizes focus, energy, and productivity. Include steps like mindfulness,"
    },
    {
        "line": "exercise, planning, and nutrition. Explain why each element is important and"
    },
    {
        "line": "provide an ideal time breakdown for efficiency.”"
    },
    {
        "line": "45. User Input: \"Write a poem about loneliness.\""
    },
    {
        "line": "Prompt: \"You are a poet exploring deep emotions. Write a free-verse poem"
    },
    {
        "line": "(20-30 lines) about loneliness, capturing its beauty and sorrow. Use vivid"
    },
    {
        "line": "imagery, metaphors, and an introspective tone. Avoid clichés and make the"
    },
    {
        "line": "reader feel the depth of solitude.\""
    },
    {
        "line": "46. User Input: \"Explain machine learning simply.\""
    },
    {
        "line": "Prompt: \"You are a data scientist explaining machine learning to someone with"
    },
    {
        "line": "no technical background. Describe what machine learning is, how it works, and"
    },
    {
        "line": "give a simple real-world example (like recommendation systems). Keep the"
    },
    {
        "line": "explanation under 300 words, using easy-to-understand terms.\""
    },
    {
        "line": "47. User Input: \"Suggest books for self-improvement.\""
    },
    {
        "line": "Prompt: \"You are a personal development coach. Recommend five must-read"
    },
    {
        "line": "self-improvement books with a short (50-word) summary for each, explaining how"
    },
    {
        "line": "they help with mindset, productivity, or success. Focus on books that provide"
    },
    {
        "line": "actionable insights and timeless wisdom.\""
    },
    {
        "line": "48. User Input: \"Write a funny short story.\""
    },
    {
        "line": "Prompt: \"You are a humorist writing a short comedic story (500-700 words). The"
    },
    {
        "line": "story should feature a bizarre but relatable situation, witty dialogue, and"
    },
    {
        "line": "unexpected humor. Use a lighthearted and engaging tone, ensuring the humor is"
    },
    {
        "line": "situational rather than forced.\""
    },
    {
        "line": "49. User Input: \"Explain quantum computing for beginners.\""
    },
    {
        "line": "Prompt: \"You are a physics professor simplifying quantum computing for"
    },
    {
        "line": "absolute beginners. Explain what it is, how it differs from classical computing,"
    },
    {
        "line": "and its potential applications. Use clear analogies, keep the explanation under"
    },
    {
        "line": "400 words, and avoid heavy math or technical jargon.\""
    },
    {
        "line": "50. User Input: \"Tips for networking at events?\""
    },
    {
        "line": "Prompt: \"List five effective networking strategies for professional events, each"
    },
    {
        "line": "under 40 words, focusing on relationship-building and confidence.\""
    },
    {
        "line": "51.  Vague Idea: \"Tell me about climate change\""
    },
    {
        "line": "Prompt: \"You are a climate scientist with expertise in environmental policy."
    },
    {
        "line": "Explain the impacts of climate change on coastal cities over the next 20 years,"
    },
    {
        "line": "focusing on rising sea levels and extreme weather. Provide the response in three"
    },
    {
        "line": "concise paragraphs, each under 100 words, covering causes, effects, and"
    },
    {
        "line": "potential solutions. Use a clear and educational tone suitable for high school"
    },
    {
        "line": "students. Avoid technical jargon and do not discuss unrelated topics like"
    },
    {
        "line": "deforestation. For example: ‘Rising seas flood homes’ → ‘Warmer oceans melt"
    },
    {
        "line": "ice, flooding coastal homes.’\""
    },
    {
        "line": "52. Vague Idea: \"Write a story\""
    },
    {
        "line": "Detailed Prompt: \"You are a creative writing expert specializing in fantasy. Write"
    },
    {
        "line": "a 300-word short story about a young mage discovering their powers in a hidden"
    },
    {
        "line": "forest village in 2025. Include a clear beginning, conflict, and resolution,"
    },
    {
        "line": "presented in narrative paragraphs. Use a whimsical and engaging tone for young"
    },
    {
        "line": "adult readers. Do not include modern technology references; focus on magical"
    },
    {
        "line": "elements. For example: ‘Sparks flew from her hands’ → ‘Golden sparks danced"
    },
    {
        "line": "from her trembling fingers, lighting the mossy glade.’\""
    },
    {
        "line": "53. Vague Idea: \"Help me with marketing\""
    },
    {
        "line": "Detailed Prompt:"
    },
    {
        "line": "\"You are a digital marketing strategist with 10 years of experience. Develop a"
    },
    {
        "line": "150-word social media campaign plan to promote a new eco-friendly clothing line"
    },
    {
        "line": "targeting millennials in 2025. Include three specific post ideas with captions and"
    },
    {
        "line": "hashtags, formatted as a bulleted list. Use a trendy and conversational tone."
    },
    {
        "line": "Avoid sales pitches; emphasize sustainability and style. For example: ‘Wear"
    },
    {
        "line": "green vibes’ → ‘Rock sustainable threads, millennials—#EcoStyle.’\""
    },
    {
        "line": "53. Vague Idea: \"Explain AI\""
    },
    {
        "line": "Detailed Prompt: \"You are an AI researcher with a focus on public education."
    },
    {
        "line": "Explain how artificial intelligence works to a general audience with no tech"
    },
    {
        "line": "background, using a 200-word explanation. Structure it as three paragraphs:"
    },
    {
        "line": "what AI is, how it learns, and real-world uses in 2025. Use a friendly and simple"
    },
    {
        "line": "tone. Avoid equations or programming terms. For example: ‘AI thinks like us’ →"
    },
    {
        "line": "‘AI mimics human thinking with clever patterns.’\""
    },
    {
        "line": "54. Vague Idea: \"Make a workout plan\""
    },
    {
        "line": "Detailed Prompt:"
    },
    {
        "line": "\"You are a certified personal trainer specializing in home fitness. Create a 4-week"
    },
    {
        "line": "workout plan for a beginner aiming to build strength, using only bodyweight"
    },
    {
        "line": "exercises. Present it as a table with days, exercises, sets, and reps, covering 3"
    },
    {
        "line": "days per week. Use a motivating and supportive tone. Do not include equipment"
    },
    {
        "line": "or advanced moves. For example: ‘Do push-ups’ → ‘Complete 3 sets of 10 knee"
    },
    {
        "line": "push-ups to build arm strength.’\""
    },
    {
        "line": "55. Vague Idea: \"Give me business advice\""
    },
    {
        "line": "Detailed Prompt: \"You are a small business consultant with expertise in retail."
    },
    {
        "line": "Provide a 250-word strategy to increase foot traffic for a local bookstore in 2025,"
    },
    {
        "line": "targeting families. Include three actionable ideas with brief explanations,"
    },
    {
        "line": "formatted as a numbered list. Use a practical and encouraging tone. Avoid"
    },
    {
        "line": "online-only tactics; focus on in-store appeal. For example: ‘Host events’ → ‘1."
    },
    {
        "line": "Host weekly storytime—draws kids and parents.’\""
    },
    {
        "line": "56. Vague Idea: \"Teach me coding\""
    },
    {
        "line": "Detailed Prompt: \"You are a patient coding instructor for beginners. Teach me"
    },
    {
        "line": "the basics of Python programming in a 300-word tutorial, assuming no prior"
    },
    {
        "line": "knowledge. Structure it as three sections: variables, loops, and functions, in"
    },
    {
        "line": "paragraph form. Use a clear and supportive tone. Do not use complex examples;"
    },
    {
        "line": "keep it to simple math operations. For example: ‘Store numbers’ → ‘Variables"
    },
    {
        "line": "store numbers like x = 5.’\""
    },
    {
        "line": "57. Vague Idea: \"Plan a trip\""
    },
    {
        "line": "Detailed Prompt: \"You are a travel planner with expertise in budget travel."
    },
    {
        "line": "Create a 4-day itinerary for a solo trip to New York City in summer 2025,"
    },
    {
        "line": "targeting a $500 budget. List daily activities and estimated costs in a table format,"
    },
    {
        "line": "covering food, sights, and transit. Use a fun and practical tone. Avoid luxury"
    },
    {
        "line": "options; focus on free or low-cost experiences. For example: ‘Visit a museum’ →"
    },
    {
        "line": "‘Day 1: Free entry at the Met—$0.’\""
    },
    {
        "line": "58. Vague Idea: \"Write a poem\""
    },
    {
        "line": "Detailed Prompt: \"You are a poet with a flair for nature themes. Write a 12-line"
    },
    {
        "line": "poem about a stormy ocean in 2025, using vivid imagery and a rhyme scheme"
    },
    {
        "line": "(ABAB). Present it in four stanzas of three lines each. Use a dramatic and"
    },
    {
        "line": "reflective tone. Do not mention people; focus on the sea and weather. For"
    },
    {
        "line": "example: ‘Waves crash loud’ → ‘Waves assault the shore with might.’\""
    },
    {
        "line": "59. Vague Idea: \"Help with math\""
    },
    {
        "line": "Detailed Prompt: \"You are a math tutor for middle school students. Explain how"
    },
    {
        "line": "to solve linear equations (e.g., 2x + 3 = 7) in a 150-word guide. Use a"
    },
    {
        "line": "step-by-step numbered list with one example solved fully. Use a patient and"
    },
    {
        "line": "cheerful tone. Avoid calculus or graphing; keep it algebraic. For example: ‘Move"
    },
    {
        "line": "numbers’ → ‘2. Subtract 3 from both sides to isolate 2x.’\""
    },
    {
        "line": "60. Vague Idea: \"Make a recipe\""
    },
    {
        "line": "Detailed Prompt: \"You are a home chef specializing in vegetarian dishes. Create"
    },
    {
        "line": "a recipe for a spicy black bean soup for 4 servings, suitable for a cozy 2025"
    },
    {
        "line": "winter night. List ingredients and steps in two separate bulleted sections, keeping"
    },
    {
        "line": "it under 200 words total. Use a warm and inviting tone. Avoid meat or dairy. For"
    },
    {
        "line": "example: ‘Add spice’ → ‘Stir in 1 tsp chili powder for a kick.’\""
    },
    {
        "line": "61. Vague Idea: \"Talk about history\""
    },
    {
        "line": "Detailed Prompt:"
    },
    {
        "line": "\"You are a historian with a focus on ancient civilizations. Discuss the rise and fall"
    },
    {
        "line": "of the Roman Empire in a 250-word summary for a general audience. Structure it"
    },
    {
        "line": "as three paragraphs: origins, peak, and decline. Use an engaging and narrative"
    },
    {
        "line": "tone. Do not use dates after 500 CE; keep it concise. For example: ‘Rome grew’"
    },
    {
        "line": "→ ‘Rome expanded through conquest and clever laws.’\""
    },
    {
        "line": "62. Vague Idea: \"Design a game\""
    },
    {
        "line": "Detailed Prompt: \"You are a game designer with experience in mobile apps."
    },
    {
        "line": "Design a concept for a puzzle game set in a 2025 futuristic city, targeting casual"
    },
    {
        "line": "players. Provide a 200-word overview with a goal, mechanics, and one level"
    },
    {
        "line": "example, in paragraph form. Use a creative and excitement-filled tone. Avoid"
    },
    {
        "line": "violence; focus on brain teasers. For example: ‘Solve it’ → ‘Match neon tiles to"
    },
    {
        "line": "power the city.’\""
    },
    {
        "line": "63. Vague Idea: \"Give me study tips\""
    },
    {
        "line": "Detailed Prompt: \"You are an academic coach for college students. Provide five"
    },
    {
        "line": "study tips for preparing for finals in 2025, tailored to a science major. Present"
    },
    {
        "line": "them as a numbered list, each under 50 words, with practical examples. Use a"
    },
    {
        "line": "motivating and friendly tone. Avoid generic advice like ‘sleep well.’ For example:"
    },
    {
        "line": "‘Review notes’ → ‘1. Quiz yourself with flashcards daily—master cell biology.’\""
    },
    {
        "line": "64. Vague Idea: \"Write a speech\""
    },
    {
        "line": "Detailed Prompt: \"You are a speechwriter for community leaders. Write a"
    },
    {
        "line": "300-word speech for a mayor opening a new park in 2025, addressing families."
    },
    {
        "line": "Structure it with an intro, three key benefits, and a closing call to action, in"
    },
    {
        "line": "paragraphs. Use a warm and inspiring tone. Avoid politics; focus on community."
    },
    {
        "line": "For example: ‘Enjoy it’ → ‘This park offers fun for all ages.”"
    },
    {
        "line": "65. Vague Idea: \"Explain space\""
    },
    {
        "line": "Detailed Prompt: \"You are an astronomer teaching kids. Explain how stars form"
    },
    {
        "line": "in a 150-word lesson for 10-year-olds, using simple analogies. Present it in two"
    },
    {
        "line": "paragraphs: birth and growth. Use a fun and curious tone. Do not use scientific"
    },
    {
        "line": "terms like ‘nebula’; keep it basic. For example: ‘Stars start’ → ‘Stars begin as"
    },
    {
        "line": "giant clouds squishing together.’\""
    },
    {
        "line": "66. Vague Idea: \"Create a budget\""
    },
    {
        "line": "Detailed Prompt: \"You are a financial advisor for young adults. Create a monthly"
    },
    {
        "line": "budget for a 25-year-old earning $3,000 in 2025, aiming to save $500. Present it"
    },
    {
        "line": "as a table with categories (e.g., rent, food) and amounts. Use a practical and"
    },
    {
        "line": "encouraging tone. Avoid luxury expenses; focus on essentials. For example:"
    },
    {
        "line": "‘Save cash’ → ‘Set aside $500 for goals.’\""
    },
    {
        "line": "67. Vague Idea: \"Talk about animals\""
    },
    {
        "line": "Detailed Prompt: \"You are a wildlife biologist with a passion for education."
    },
    {
        "line": "Discuss three unique adaptations of Arctic animals in a 200-word piece for a"
    },
    {
        "line": "nature blog. Use a numbered list with each under 70 words. Use an enthusiastic"
    },
    {
        "line": "and informative tone. Avoid plants; focus on animals. For example: ‘Thick fur’ →"
    },
    {
        "line": "‘1. Polar bears’ thick fur traps heat like a blanket.’\""
    },
    {
        "line": "68. Vague Idea: \"Plan a party”"
    },
    {
        "line": "Detailed Prompt: \"You are an event planner for small gatherings. Plan a 2025"
    },
    {
        "line": "birthday party for 10 adults on a $200 budget. List a theme, food, and two"
    },
    {
        "line": "activities in a bulleted format, under 150 words total. Use a festive and casual"
    },
    {
        "line": "tone. Avoid alcohol; focus on fun. For example: ‘Play games’ → ‘- Trivia contest"
    },
    {
        "line": "with silly prizes.’\""
    },
    {
        "line": "69. Vague Idea: \"Write a review\""
    },
    {
        "line": "Detailed Prompt: \"You are a tech reviewer for a consumer blog. Write a"
    },
    {
        "line": "250-word review of a fictional 2025 smartwatch for fitness enthusiasts. Structure"
    },
    {
        "line": "it with pros, cons, and a verdict in paragraphs. Use an honest and conversational"
    },
    {
        "line": "tone. Do not mention competitors; focus on features. For example: ‘Tracks well’"
    },
    {
        "line": "→ ‘It logs steps accurately all day.’\""
    },
    {
        "line": "70. Vague Idea: \"Help me relax\""
    },
    {
        "line": "Detailed Prompt: \"You are a wellness coach specializing in stress relief. Provide"
    },
    {
        "line": "a 5-step relaxation routine for a busy worker in 2025, post-workday. Present it as"
    },
    {
        "line": "a numbered list, each step under 50 words, with clear actions. Use a calm and"
    },
    {
        "line": "soothing tone. Avoid meditation; focus on physical steps. For example: ‘Stretch"
    },
    {
        "line": "out’ → ‘1. Stretch arms gently to release tension.’\""
    },
    {
        "line": "71. Vague Idea: \"Explain art\""
    },
    {
        "line": "Detailed Prompt:"
    },
    {
        "line": "\"You are an art historian for a museum guide. Explain the Renaissance art"
    },
    {
        "line": "movement to tourists in a 200-word overview. Use three paragraphs: origins, key"
    },
    {
        "line": "features, and legacy. Use an engaging and approachable tone. Avoid modern art;"
    },
    {
        "line": "keep it historical. For example: ‘Paintings glowed’ → ‘Artists used light to make"
    },
    {
        "line": "scenes pop.’\""
    },
    {
        "line": "72. Vague Idea: \"Make a quiz\""
    },
    {
        "line": "Detailed Prompt: \"You are a teacher creating educational tools. Design a"
    },
    {
        "line": "5-question trivia quiz about 2025 space exploration for high schoolers. Present it"
    },
    {
        "line": "as a numbered list with questions and short answers. Use a fun and curious tone."
    },
    {
        "line": "Avoid math; focus on facts. For example: ‘Who went?’ → ‘1. Who led the Mars"
    },
    {
        "line": "mission? (Dr. Lee)’”"
    },
    {
        "line": "73. Vague Idea: \"Talk about food\""
    },
    {
        "line": "Detailed Prompt:"
    },
    {
        "line": "\"You are a food critic with a love for global cuisine. Discuss three trending dishes"
    },
    {
        "line": "in 2025 for a foodie magazine, targeting adventurous eaters. Use a numbered"
    },
    {
        "line": "list, each under 70 words, with descriptions. Use an excited and flavorful tone."
    },
    {
        "line": "Avoid recipes; focus on appeal. For example: ‘Spicy treat’ → ‘1. Chili mango"
    },
    {
        "line": "tacos—sweet heat explodes!’\""
    },
    {
        "line": "74. Vague Idea: \"Help me sleep\""
    },
    {
        "line": "Detailed Prompt: \"You are a sleep expert for busy professionals. Provide a"
    },
    {
        "line": "150-word nighttime routine to improve sleep in 2025, for someone with screen"
    },
    {
        "line": "time habits. Structure it as a bulleted list with 5 steps. Use a gentle and"
    },
    {
        "line": "reassuring tone. Avoid medication; focus on habits. For example: ‘Dim lights’ → ‘-"
    },
    {
        "line": "Dim lights 1 hour before bed to unwind.’\""
    },
    {
        "line": "75. Vague Idea: \"Write a letter\""
    },
    {
        "line": "Detailed Prompt: \"You are a career coach drafting professional correspondence."
    },
    {
        "line": "Write a 200-word cover letter for a 2025 marketing job, from a recent graduate to"
    },
    {
        "line": "a tech firm. Include an intro, skills, and closing, in paragraphs. Use a confident"
    },
    {
        "line": "and formal tone. Avoid clichés like ‘team player.’ For example: ‘I excel’ → ‘My"
    },
    {
        "line": "campaigns boosted engagement 20%.’\""
    },
    {
        "line": "76. Vague Idea: \"Explain music\""
    },
    {
        "line": "Detailed Prompt: \"You are a music teacher for beginners. Explain how hip-hop"
    },
    {
        "line": "evolved in a 200-word lesson for Teens in 2025. Use three paragraphs: roots,"
    },
    {
        "line": "rise, and modern trends. Use a cool and relatable tone. Avoid classical music;"
    },
    {
        "line": "keep it hip-hop focused. For example: ‘Beats dropped’ → ‘DJ Kool Herc spun"
    },
    {
        "line": "beats that sparked a revolution.’\""
    },
    {
        "line": "77. Vague Idea: \"Plan a project\""
    },
    {
        "line": "Detailed Prompt: \"You are a project manager for a nonprofit. Plan a 2025"
    },
    {
        "line": "fundraiser to raise $5,000 for a local shelter, targeting donors. Provide a"
    },
    {
        "line": "200-word plan with timeline, tasks, and goals in a bulleted list. Use a strategic"
    },
    {
        "line": "and hopeful tone. Avoid vague steps; be specific. For example: ‘Get sponsors’ →"
    },
    {
        "line": "‘- Secure 3 sponsors by March 1.’\""
    },
    {
        "line": "78. Vague Idea: \"Give me gift ideas\""
    },
    {
        "line": "Detailed Prompt: \"You are a lifestyle blogger with a knack for thoughtful gifts."
    },
    {
        "line": "Suggest five unique gift ideas for a 30-year-old artist in 2025, under $50 each."
    },
    {
        "line": "List them with names and short reasons in a numbered format, under 150 words"
    },
    {
        "line": "total. Use a creative and friendly tone. Avoid generic items like mugs. For"
    },
    {
        "line": "example: ‘Paint set’ → ‘1. Watercolor kit—sparks new techniques.’\""
    },
    {
        "line": "79. Vague Idea: \"Talk about tech\""
    },
    {
        "line": "Detailed Prompt: \"You are a tech journalist for a 2025 trends report. Discuss"
    },
    {
        "line": "three emerging gadgets for home use in a 250-word article. Use a numbered list,"
    },
    {
        "line": "each under 80 words, with features and benefits. Use an enthusiastic and"
    },
    {
        "line": "futuristic tone. Avoid phones; focus on home tech. For example: ‘Smart lamp’ →"
    },
    {
        "line": "‘1. Mood-sync lamp—adjusts light to your vibe.’\""
    },
    {
        "line": "80. Vague Idea: \"Help me organize\""
    },
    {
        "line": "Detailed Prompt: \"You are a professional organizer for small spaces. Provide a"
    },
    {
        "line": "5-step plan to declutter a 2025 studio apartment, for a single renter. Present it as"
    },
    {
        "line": "a numbered list, each under 50 words, with clear actions. Use a practical and"
    },
    {
        "line": "upbeat tone. Avoid expensive tools; keep it simple. For example: ‘Sort stuff’ → ‘1."
    },
    {
        "line": "Sort clothes into keep/donate piles.’\""
    },
    {
        "line": "81. Vague Idea: \"Write a script\""
    },
    {
        "line": "Detailed Prompt: \"You are a screenwriter for short films. Write a 200-word script"
    },
    {
        "line": "for a 2025 sci-fi scene where a robot confesses emotions to a human, set on"
    },
    {
        "line": "Mars. Use dialogue and stage directions in script format. Use a poignant and"
    },
    {
        "line": "futuristic tone. Avoid clichés like ‘I love you.’ For example: ‘I feel’ → ‘ROBOT: I"
    },
    {
        "line": "process sadness when you leave.’\""
    },
    {
        "line": "82. Vague Idea: \"Explain health\""
    },
    {
        "line": "Detailed Prompt: \"You are a nurse educating patients. Explain how exercise"
    },
    {
        "line": "benefits mental health in a 150-word guide for adults in 2025. Use three"
    },
    {
        "line": "paragraphs: stress, mood, and sleep. Use a caring and simple tone. Avoid"
    },
    {
        "line": "medical jargon; keep it relatable. For example: ‘Feel better’ → ‘Exercise lifts your"
    },
    {
        "line": "mood like sunshine.’\""
    },
    {
        "line": "83. Vague Idea: \"Make a playlist\""
    },
    {
        "line": "Detailed Prompt: \"You are a music curator for road trips. Create a 10-song"
    },
    {
        "line": "playlist for a 2025 cross-country drive, targeting Gen Z. List song titles and artists"
    },
    {
        "line": "in a numbered format, with a 50-word intro explaining the vibe. Use a chill and"
    },
    {
        "line": "youthful tone. Avoid classical; keep it modern. For example: ‘Vibe out’ → ‘Tunes"
    },
    {
        "line": "for cruising open roads.’\""
    },
    {
        "line": "84. Vague Idea: \"Talk about fashion\""
    },
    {
        "line": "Detailed Prompt: \"You are a fashion editor for a 2025 style guide. Discuss three"
    },
    {
        "line": "sustainable fashion trends for urban teens in a 200-word piece. Use a numbered"
    },
    {
        "line": "list, each under 70 words, with descriptions. Use a trendy and eco-conscious"
    },
    {
        "line": "tone. Avoid luxury brands; focus on accessibility. For example: ‘Green fit’ → ‘1."
    },
    {
        "line": "Upcycled tees—fresh and planet-friendly.’\""
    },
    {
        "line": "85. Vague Idea: \"Help me learn a language\""
    },
    {
        "line": "Detailed Prompt: \"You are a language tutor for beginners. Teach me 10 basic"
    },
    {
        "line": "Spanish phrases for travel in 2025, targeting tourists. Present them in a table with"
    },
    {
        "line": "phrases, translations, and uses, under 150 words total. Use a friendly and"
    },
    {
        "line": "practical tone. Avoid grammar lessons; focus on phrases. For example: ‘Hola’ →"
    },
    {
        "line": "‘Hello—greet locals warmly.’\""
    },
    {
        "line": "86. Vague Idea: \"Write an ad\""
    },
    {
        "line": "Detailed Prompt: \"You are a copywriter for small businesses. Write a 100-word"
    },
    {
        "line": "ad for a 2025 eco-friendly candle shop targeting gift buyers. Include a hook,"
    },
    {
        "line": "benefits, and call to action, in paragraph form. Use a cozy and persuasive tone."
    },
    {
        "line": "Avoid discounts; emphasize quality. For example: ‘Glow green’ → ‘Light up with"
    },
    {
        "line": "sustainable, hand-poured glow.’\""
    },
    {
        "line": "87. Vague Idea: \"Explain money\""
    },
    {
        "line": "Detailed Prompt: \"You are a financial educator for teens. Explain how compound"
    },
    {
        "line": "interest works in a 150-word lesson for 16-year-olds in 2025. Use two"
    },
    {
        "line": "paragraphs: concept and example (saving $100/year). Use a relatable and"
    },
    {
        "line": "upbeat tone. Avoid complex formulas; keep it simple. For example: ‘Money"
    },
    {
        "line": "grows’ → ‘Your cash multiplies over time like magic.’\""
    },
    {
        "line": "88. Vague Idea: \"Plan a lesson\""
    },
    {
        "line": "Detailed Prompt: \"You are a science teacher for middle school. Plan a"
    },
    {
        "line": "45-minute lesson on photosynthesis for 2025, targeting 7th graders. Provide a"
    },
    {
        "line": "timeline and three activities in a bulleted list, under 200 words. Use an engaging"
    },
    {
        "line": "and clear tone. Avoid homework; focus on classwork. For example: ‘Draw it’ → ‘-"
    },
    {
        "line": "10 min: Sketch a plant using sunlight.’\""
    },
    {
        "line": "89. Vague Idea: \"Give me career advice\""
    },
    {
        "line": "Detailed Prompt: \"You are a career counselor for recent grads. Provide three"
    },
    {
        "line": "tips for landing a 2025 tech job, targeting coders. Use a numbered list, each"
    },
    {
        "line": "under 70 words, with actionable steps. Use a confident and supportive tone."
    },
    {
        "line": "Avoid generic advice like ‘network.’ For example: ‘Show skills’ → ‘1. Build a"
    },
    {
        "line": "GitHub portfolio with 3 projects.’\""
    },
    {
        "line": "90. Vague Idea: \"Talk about sports\""
    },
    {
        "line": "Detailed Prompt: \"You are a sports commentator for a youth blog. Discuss three"
    },
    {
        "line": "rising sports trends in 2025 for teens in a 200-word post. Use a numbered list,"
    },
    {
        "line": "each under 70 words, with explanations. Use an energetic and cool tone. Avoid"
    },
    {
        "line": "professional leagues; focus on casual play. For example: ‘Kick it’ → ‘1. Street"
    },
    {
        "line": "soccer—fast and free.’\""
    },
    {
        "line": "91. Vague Idea: \"Help me cook\""
    },
    {
        "line": "Detailed Prompt: \"You are a cooking instructor for novices. Teach me how to"
    },
    {
        "line": "make a 2025 vegan stir-fry for two in a 150-word guide. List 5 ingredients and 5"
    },
    {
        "line": "steps in two bulleted sections. Use a simple and encouraging tone. Avoid meat or"
    },
    {
        "line": "fancy tools. For example: ‘Add sauce’ → ‘- Pour soy sauce for tasty flavor.’\""
    },
    {
        "line": "92. Vague Idea: \"Explain energy\""
    },
    {
        "line": "Detailed Prompt: \"You are a physicist for a science magazine. Explain"
    },
    {
        "line": "renewable energy sources in a 250-word article for adults in 2025. Use three"
    },
    {
        "line": "paragraphs: solar, wind, and hydro. Use an informative and optimistic tone. Avoid"
    },
    {
        "line": "nuclear; keep it green. For example: ‘Sun shines’ → ‘Solar panels catch sunlight"
    },
    {
        "line": "for clean power.’\""
    },
    {
        "line": "93. Vague Idea: \"Make a survey\""
    },
    {
        "line": "Detailed Prompt: \"You are a market researcher for a startup. Create a"
    },
    {
        "line": "5-question survey about 2025 app preferences for young adults. Present it as a"
    },
    {
        "line": "numbered list with questions and short purposes, under 150 words. Use a casual"
    },
    {
        "line": "and curious tone. Avoid tech jargon. For example: ‘What’s hot?’ → ‘1. Which app"
    },
    {
        "line": "type do you love? (Why use it?)’\""
    },
    {
        "line": "94. Vague Idea: \"Write a joke\""
    },
    {
        "line": "Detailed Prompt: \"You are a comedian for a family show. Write three clean jokes"
    },
    {
        "line": "about 2025 tech life, targeting kids and parents. List them in a numbered format,"
    },
    {
        "line": "each under 20 words, with punchlines. Use a silly and lighthearted tone. Avoid"
    },
    {
        "line": "dark humor. For example: ‘Robot fails’ → ‘1. Why’d the robot blush? It forgot its"
    },
    {
        "line": "charger!’\""
    },
    {
        "line": "95. Vague Idea: \"Talk about school\""
    },
    {
        "line": "Detailed Prompt: \"You are an education expert for a parent blog. Discuss three"
    },
    {
        "line": "benefits of hybrid learning in 2025 for high schoolers in a 200-word piece. Use a"
    },
    {
        "line": "numbered list, each under 70 words, with explanations. Use a positive and"
    },
    {
        "line": "practical tone. Avoid negatives; focus on gains. For example: ‘Flex time’ → ‘1."
    },
    {
        "line": "Hybrid lets kids learn at their pace.’\""
    },
    {
        "line": "96. Vague Idea: \"Help me draw\""
    },
    {
        "line": "Detailed Prompt: \"You are an art teacher for beginners. Teach me to sketch a"
    },
    {
        "line": "2025 cityscape in a 150-word guide, targeting hobbyists. Use 5 steps in a"
    },
    {
        "line": "numbered list, each under 40 words, with clear actions. Use an encouraging and"
    },
    {
        "line": "creative tone. Avoid color; focus on pencil. For example: ‘Start tall’ → ‘1. Draw tall"
    },
    {
        "line": "buildings with straight lines.’\""
    },
    {
        "line": "97. Vague Idea: \"Explain time\""
    },
    {
        "line": "Detailed Prompt: \"You are a philosopher for a curious audience. Explain why"
    },
    {
        "line": "time feels faster as we age in a 200-word piece for adults in 2025. Use two"
    },
    {
        "line": "paragraphs: theory and perception. Use a thoughtful and relatable tone. Avoid"
    },
    {
        "line": "physics; keep it human-focused. For example: ‘Days blur’ → ‘Routine makes"
    },
    {
        "line": "days slip by unnoticed.’\" 98."
    },
    {
        "line": "Vague Idea: \"Plan a diet\""
    },
    {
        "line": "Detailed Prompt: \"You are a nutritionist for active lifestyles. Create a 1-day meal"
    },
    {
        "line": "plan for a 2025 runner, targeting energy. List breakfast, lunch, dinner, and two"
    },
    {
        "line": "snacks in a bulleted format, under 200 words. Use a healthy and upbeat tone."
    },
    {
        "line": "Avoid supplements; use whole foods. For example: ‘Fuel up’ → ‘- Breakfast:"
    },
    {
        "line": "Oatmeal with berries for stamina.’\""
    },
    {
        "line": "99. Vague Idea: \"Give me life tips\""
    },
    {
        "line": "Detailed Prompt: \"You are a life coach for young professionals. Provide five tips"
    },
    {
        "line": "for work-life balance in 2025, targeting 30-year-olds. Use a numbered list, each"
    },
    {
        "line": "under 50 words, with practical steps. Use an inspiring and friendly tone. Avoid"
    },
    {
        "line": "clichés like ‘unplug.’ For example: ‘Set limits’ → ‘1. End work at 6 PM sharp.’\""
    },
    {
        "line": "Examples of good prompts with good structure for RESUME/ NETWORKING"
    },
    {
        "line": "Optimizing Resume:"
    },
    {
        "line": "Prompt: \"You are a professional resume writer specializing in INDUSTRY/FIELD)."
    },
    {
        "line": "Rewrite my resume to highlight my achievements and align it with a (SPECIFIC JOB TITLE)."
    },
    {
        "line": "Focus on keywords from the job description and a modern, ATS-friendly format. My current"
    },
    {
        "line": "resume: (INSERT TEXT).\""
    },
    {
        "line": "Tailor for Industry:"
    },
    {
        "line": "Prompt: \"Act as a career consultant for (SPECIFIC INDUSTRY). Create a tailored resume for a"
    },
    {
        "line": "(SPECIFIC JOB TITLE) by emphasizing my transferable skills, technical expertise, and"
    },
    {
        "line": "leadership qualities. My career history and skills:"
    },
    {
        "line": "(INSERT INFORMATION).\""
    },
    {
        "line": "Highlight Results"
    },
    {
        "line": "Prompt: \"Rewrite my resume to make it results-oriented and concise. Highlight measurable"
    },
    {
        "line": "achievements using numbers, percentages, or metrics where possible. Here's my current"
    },
    {
        "line": "resume: (INSERT RESUME TEXT). Target position: (INSERT TARGET JOB TITLE).\""
    },
    {
        "line": "Executive Resume"
    },
    {
        "line": "Prompt: \"As an expert in crafting executive-level resumes, tailor my resume to emphasize"
    },
    {
        "line": "leadership and strategic accomplishments for a (SPECIFIC ROLE). Use power verbs and"
    },
    {
        "line": "quantify the impact. My experience: (INSERT DETAILS). Desired industry: (INSERT"
    },
    {
        "line": "INDUSTRY).\""
    },
    {
        "line": "Targeted Resume"
    },
    {
        "line": "Prompt: \"Turn my generic resume into a targeted document for a (SPECIFIC ROLE) in"
    },
    {
        "line": "(SPECIFIC INDUSTRY). Highlight my soft skills, technical expertise, and any certifications"
    },
    {
        "line": "relevant to the job description. My resume text: (INSERT TEXT). Job description: (INSERT"
    },
    {
        "line": "DESCRIPTION).\""
    },
    {
        "line": "Fresh Format"
    },
    {
        "line": "Prompt: \"Create a fresh resume format showcasing my (YEARS OF EXPERIENCE) in"
    },
    {
        "line": "(INDUSTRY/ROLE). Emphasize adaptability, problem-solving, and collaborative achievements."
    },
    {
        "line": "Provide a visually appealing yet ATS-compatible format. My details: (INSERT INFORMATION).\""
    },
    {
        "line": "ATS Optimization"
    },
    {
        "line": "Prompt: \"Optimize my resume for an applicant tracking system (ATS) for the role of (SPECIFIC"
    },
    {
        "line": "JOB TITLE). Ensure it includes job-specific keywords, clear sections, and a professional layout."
    },
    {
        "line": "My resume draft: (INSERT TEXT)."
    },
    {
        "line": "Standout Summary"
    },
    {
        "line": "Prompt: \"Act as a career strategist. Create a standout resume summary that captures my"
    },
    {
        "line": "expertise in (SPECIFIC SKILLS/FIELDS), showcasing value for a (SPECIFIC ROLE). Include"
    },
    {
        "line": "impactful achievements to grab attention. My career background: (INSERT DETAILS).\""
    },
    {
        "line": "Here are 50 examples of fairly vague user inputs and their corresponding premium prompts,"
    },
    {
        "line": "listed one under the other, designed to elicit the latest and most efficient knowledge from any"
    },
    {
        "line": "LLM. These prompts avoid specific years like 2025 for timeless relevance, include all key"
    },
    {
        "line": "elements (goal, role, context, format, guardrails, tone), and leave room for user-specific data."
    },
    {
        "line": "1. Vague Input: \"Tell me about cooking\""
    },
    {
        "line": "Premium Prompt: \"You are a professional chef with expertise in global cuisines."
    },
    {
        "line": "Explain the fundamentals of cooking techniques suitable for home cooks, incorporating"
    },
    {
        "line": "[user-specific data, e.g., dietary preferences]. Provide a 200-word guide in three"
    },
    {
        "line": "paragraphs: preparation, cooking methods, and plating. Use a warm and instructional"
    },
    {
        "line": "tone. Avoid restaurant-only techniques; focus on accessible skills.\""
    },
    {
        "line": "2."
    },
    {
        "line": "Vague Input: \"Help with a budget\""
    },
    {
        "line": "Premium Prompt: \"You are a financial planner specializing in personal finance. Create"
    },
    {
        "line": "a monthly budget for an individual earning [user-specific data, e.g., monthly income],"
    },
    {
        "line": "aiming to save 20%. Present it as a table with categories and amounts. Use a practical"
    },
    {
        "line": "and encouraging tone. Exclude luxury expenses; emphasize essentials.\""
    },
    {
        "line": "3."
    },
    {
        "line": "Vague Input: \"Write a story\""
    },
    {
        "line": "Premium Prompt: \"You are a creative writer with a flair for immersive narratives. Write"
    },
    {
        "line": "a 300-word short story set in [user-specific data, e.g., a chosen location or genre], with a"
    },
    {
        "line": "clear beginning, conflict, and resolution. Use narrative paragraphs and a vivid, engaging"
    },
    {
        "line": "tone. Avoid modern slang; focus on timeless themes.\""
    },
    {
        "line": "4."
    },
    {
        "line": "Vague Input: \"Explain science\""
    },
    {
        "line": "Premium Prompt: \"You are a science educator with cutting-edge knowledge. Explain"
    },
    {
        "line": "how CRISPR edits genes, in a 200-word guide, using three paragraphs—concept,"
    },
    {
        "line": "process, and uses. Use a clear and wonder-filled tone, avoiding jargon. For example:"
    },
    {
        "line": "‘Snip DNA’ → ‘CRISPR cuts genes like scissors.’\""
    },
    {
        "line": "5."
    },
    {
        "line": "Vague Input: \"Plan a workout\""
    },
    {
        "line": "Premium Prompt: \"You are a certified fitness trainer focused on sustainable routines."
    },
    {
        "line": "Design a 4-week workout plan for [user-specific data, e.g., fitness level or goal], using"
    },
    {
        "line": "bodyweight exercises. Present it as a table with days, exercises, and reps. Use a"
    },
    {
        "line": "motivating and clear tone. Avoid gym equipment.\""
    },
    {
        "line": "6."
    },
    {
        "line": "Vague Input: \"Give me business tips\""
    },
    {
        "line": "Premium Prompt: \"You are a business strategist for small enterprises. Provide three"
    },
    {
        "line": "tips to boost profitability for [user-specific data, e.g., a specific business type], each"
    },
    {
        "line": "under 70 words in a numbered list. Use a sharp and actionable tone. Avoid generic"
    },
    {
        "line": "advice; focus on current trends.\""
    },
    {
        "line": "7."
    },
    {
        "line": "Vague Input: \"Teach me coding\""
    },
    {
        "line": "Premium Prompt: \"You are a coding mentor for novices. Teach me the basics of"
    },
    {
        "line": "[user-specific data, e.g., Python or Java] in a 250-word tutorial, assuming no prior"
    },
    {
        "line": "knowledge. Use three paragraphs: syntax, logic, and a simple example. Use a patient"
    },
    {
        "line": "and approachable tone. Avoid advanced concepts.\""
    },
    {
        "line": "8."
    },
    {
        "line": "Vague Input: \"Plan a vacation\""
    },
    {
        "line": "Premium Prompt: \"You are a travel expert specializing in tailored trips. Create a 5-day"
    },
    {
        "line": "itinerary for [user-specific data, e.g., destination or budget], targeting a solo traveler. List"
    },
    {
        "line": "daily activities and costs in a table. Use a fun and practical tone. Avoid luxury options"
    },
    {
        "line": "unless specified.\""
    },
    {
        "line": "9."
    },
    {
        "line": "Vague Input: \"Write a poem\""
    },
    {
        "line": "Premium Prompt: \"You are a poet with a passion for evocative imagery. Write a 12-line"
    },
    {
        "line": "poem about [user-specific data, e.g., a theme like love], using an ABAB rhyme scheme"
    },
    {
        "line": "in four stanzas. Use a reflective and lyrical tone. Avoid modern references unless"
    },
    {
        "line": "requested.\""
    },
    {
        "line": "10."
    },
    {
        "line": "Vague Input: \"Help with math\""
    },
    {
        "line": "Premium Prompt: \"You are a math tutor for students. Explain how to solve"
    },
    {
        "line": "[user-specific data, e.g., quadratic equations] in a 150-word guide. Use a numbered list"
    },
    {
        "line": "with steps and one example. Use a clear and supportive tone. Avoid calculus unless"
    },
    {
        "line": "specified.\""
    },
    {
        "line": "11."
    },
    {
        "line": "Vague Input: \"Create a recipe\""
    },
    {
        "line": "Premium Prompt: \"You are a culinary expert in home cooking. Develop a recipe for"
    },
    {
        "line": "[user-specific data, e.g., a dish type or cuisine], serving 4. List ingredients and steps in"
    },
    {
        "line": "two bulleted sections, under 200 words. Use an inviting and simple tone. Avoid rare"
    },
    {
        "line": "ingredients.\""
    },
    {
        "line": "12."
    },
    {
        "line": "Vague Input: \"Talk about history\""
    },
    {
        "line": "Premium Prompt: \"You are a historian specializing in engaging narratives. Discuss"
    },
    {
        "line": "[user-specific data, e.g., a historical event or era] in a 200-word summary. Use three"
    },
    {
        "line": "paragraphs: origins, key moments, and impact. Use a storytelling and accessible tone."
    },
    {
        "line": "Avoid excessive dates.\""
    },
    {
        "line": "13."
    },
    {
        "line": "Vague Input: \"Design a game\""
    },
    {
        "line": "Premium Prompt: \"You are a game designer for casual players. Create a concept for"
    },
    {
        "line": "[user-specific data, e.g., a game genre or setting], in a 200-word overview. Include goal,"
    },
    {
        "line": "mechanics, and one level, in paragraphs. Use an excited and creative tone. Avoid"
    },
    {
        "line": "complex coding details.\""
    },
    {
        "line": "14."
    },
    {
        "line": "Vague Input: \"Give study tips\""
    },
    {
        "line": "Premium Prompt: \"You are an academic coach for learners. Provide five study tips for"
    },
    {
        "line": "[user-specific data, e.g., a subject or exam type], each under 50 words in a numbered"
    },
    {
        "line": "list. Use a motivating and practical tone. Avoid vague advice like ‘focus.’\""
    },
    {
        "line": "15."
    },
    {
        "line": "Vague Input: \"Write a speech\""
    },
    {
        "line": "Premium Prompt: \"You are a speechwriter for community events. Write a 250-word"
    },
    {
        "line": "speech for [user-specific data, e.g., an occasion or audience], with an intro, three points,"
    },
    {
        "line": "and a closing. Use paragraphs and an inspiring tone. Avoid controversy unless"
    },
    {
        "line": "specified.\""
    },
    {
        "line": "16."
    },
    {
        "line": "Vague Input: \"Explain space\""
    },
    {
        "line": "Premium Prompt: \"You are an astronomer for curious minds. Explain [user-specific"
    },
    {
        "line": "data, e.g., black holes] in a 150-word lesson for beginners. Use two paragraphs: what it"
    },
    {
        "line": "is and why it matters. Use a wonder-filled and simple tone. Avoid equations.\""
    },
    {
        "line": "17."
    },
    {
        "line": "Vague Input: \"Make a budget\""
    },
    {
        "line": "Premium Prompt: \"You are a financial advisor for everyday people. Create a monthly"
    },
    {
        "line": "budget for [user-specific data, e.g., income or goals], prioritizing savings. Use a table"
    },
    {
        "line": "with categories and amounts. Use an encouraging and clear tone. Avoid extravagant"
    },
    {
        "line": "spending.\""
    },
    {
        "line": "18."
    },
    {
        "line": "Vague Input: \"Talk about animals\""
    },
    {
        "line": "Premium Prompt: \"You are a zoologist with a love for wildlife. Discuss three"
    },
    {
        "line": "adaptations of [user-specific data, e.g., a species or habitat], each under 70 words in a"
    },
    {
        "line": "numbered list. Use an enthusiastic and informative tone. Avoid unrelated ecosystems.\""
    },
    {
        "line": "19."
    },
    {
        "line": "Vague Input: \"Plan a party\""
    },
    {
        "line": "Premium Prompt: \"You are an event planner for fun gatherings. Plan a party for"
    },
    {
        "line": "[user-specific data, e.g., number of guests or theme], on a modest budget. List theme,"
    },
    {
        "line": "food, and activities in bullets, under 150 words. Use a festive and casual tone.\""
    },
    {
        "line": "20."
    },
    {
        "line": "Vague Input: \"Write a review\""
    },
    {
        "line": "Premium Prompt: \"You are a reviewer for a lifestyle blog. Write a 200-word review of"
    },
    {
        "line": "[user-specific data, e.g., a product or service], with pros, cons, and a verdict in"
    },
    {
        "line": "paragraphs. Use an honest and conversational tone. Avoid bias unless specified.\""
    },
    {
        "line": "21."
    },
    {
        "line": "Vague Input: \"Help me relax\""
    },
    {
        "line": "Premium Prompt: \"You are a wellness expert for stress management. Provide a 5-step"
    },
    {
        "line": "relaxation routine for [user-specific data, e.g., a stressful situation], each under 50 words"
    },
    {
        "line": "in a numbered list. Use a soothing and practical tone. Avoid spiritual practices unless"
    },
    {
        "line": "requested.\""
    },
    {
        "line": "22."
    },
    {
        "line": "Vague Input: \"Explain art\""
    },
    {
        "line": "Premium Prompt: \"You are an art educator for novices. Explain [user-specific data,"
    },
    {
        "line": "e.g., an art movement] in a 200-word overview. Use three paragraphs: origins, style, and"
    },
    {
        "line": "influence. Use an engaging and approachable tone. Avoid modern trends unless"
    },
    {
        "line": "specified.\""
    },
    {
        "line": "23."
    },
    {
        "line": "Vague Input: \"Make a quiz\""
    },
    {
        "line": "Premium Prompt: \"You are a trivia creator for learners. Design a 5-question quiz on"
    },
    {
        "line": "[user-specific data, e.g., a topic], with answers in a numbered list. Keep it under 150"
    },
    {
        "line": "words. Use a fun and curious tone. Avoid overly hard questions.\""
    },
    {
        "line": "24."
    },
    {
        "line": "Vague Input: \"Talk about food\""
    },
    {
        "line": "Premium Prompt: \"You are a food enthusiast for a magazine. Discuss three popular"
    },
    {
        "line": "dishes in [user-specific data, e.g., a cuisine or region], each under 70 words in a"
    },
    {
        "line": "numbered list. Use a flavorful and excited tone. Avoid recipes unless requested.\""
    },
    {
        "line": "25."
    },
    {
        "line": "Vague Input: \"Help me sleep\""
    },
    {
        "line": "Premium Prompt: \"You are a sleep coach for busy people. Provide a 150-word"
    },
    {
        "line": "nighttime routine for [user-specific data, e.g., a lifestyle], in 5 bulleted steps. Use a gentle"
    },
    {
        "line": "and reassuring tone. Avoid tech unless specified.\""
    },
    {
        "line": "26."
    },
    {
        "line": "Vague Input: \"Write a letter\""
    },
    {
        "line": "Premium Prompt: \"You are a professional writer for correspondence. Write a 200-word"
    },
    {
        "line": "letter for [user-specific data, e.g., purpose or recipient], with an intro, body, and closing in"
    },
    {
        "line": "paragraphs. Use a formal and confident tone. Avoid casual slang.\""
    },
    {
        "line": "27."
    },
    {
        "line": "Vague Input: \"Explain music\""
    },
    {
        "line": "Premium Prompt: \"You are a music historian for enthusiasts. Explain the evolution of"
    },
    {
        "line": "[user-specific data, e.g., a genre] in a 200-word piece. Use three paragraphs: roots,"
    },
    {
        "line": "growth, and now. Use a cool and relatable tone. Avoid unrelated styles.\""
    },
    {
        "line": "28."
    },
    {
        "line": "Vague Input: \"Plan a project\""
    },
    {
        "line": "Premium Prompt: \"You are a project manager for efficient teams. Plan a project for"
    },
    {
        "line": "[user-specific data, e.g., goal or scope], in a 200-word timeline with 3 phases in bullets."
    },
    {
        "line": "Use a strategic and clear tone. Avoid vague steps.\""
    },
    {
        "line": "29."
    },
    {
        "line": "Vague Input: \"Give me gift ideas\""
    },
    {
        "line": "Premium Prompt: \"You are a gift expert for unique finds. Suggest five gifts for"
    },
    {
        "line": "[user-specific data, e.g., a person or occasion], each under 50 words in a numbered list."
    },
    {
        "line": "Use a thoughtful and friendly tone. Avoid generic items.\""
    },
    {
        "line": "30."
    },
    {
        "line": "Vague Input: \"Talk about tech\""
    },
    {
        "line": "Premium Prompt: \"You are a tech analyst for current trends. Discuss three innovative"
    },
    {
        "line": "gadgets in [user-specific data, e.g., a field], each under 70 words in a numbered list. Use"
    },
    {
        "line": "a futuristic and excited tone. Avoid outdated tech.\""
    },
    {
        "line": "31."
    },
    {
        "line": "Vague Input: \"Help me organize\""
    },
    {
        "line": "Premium Prompt: \"You are an organization specialist for small spaces. Provide a"
    },
    {
        "line": "5-step plan to declutter [user-specific data, e.g., a room], each under 50 words in a"
    },
    {
        "line": "numbered list. Use a practical and upbeat tone. Avoid costly tools.\""
    },
    {
        "line": "32."
    },
    {
        "line": "Vague Input: \"Write a script\""
    },
    {
        "line": "Premium Prompt: \"You are a screenwriter for short scenes. Write a 200-word script for"
    },
    {
        "line": "[user-specific data, e.g., a setting or theme], with dialogue and directions in script format."
    },
    {
        "line": "Use a dramatic and vivid tone. Avoid clichés.\""
    },
    {
        "line": "33."
    },
    {
        "line": "Vague Input: \"Explain health\""
    },
    {
        "line": "Premium Prompt: \"You are a health educator for the public. Explain how [user-specific"
    },
    {
        "line": "data, e.g., exercise] benefits wellness in a 150-word guide. Use three paragraphs:"
    },
    {
        "line": "physical, mental, social. Use a caring and simple tone.\""
    },
    {
        "line": "34."
    },
    {
        "line": "Vague Input: \"Make a playlist\""
    },
    {
        "line": "Premium Prompt: \"You are a music curator for vibes. Create a 10-song playlist for"
    },
    {
        "line": "[user-specific data, e.g., an activity], with titles and artists in a numbered list and a"
    },
    {
        "line": "50-word intro. Use a chill and fun tone.\""
    },
    {
        "line": "35."
    },
    {
        "line": "Vague Input: \"Talk about fashion\""
    },
    {
        "line": "Premium Prompt: \"You are a fashion writer for trends. Discuss three current styles in"
    },
    {
        "line": "[user-specific data, e.g., a demographic], each under 70 words in a numbered list. Use a"
    },
    {
        "line": "trendy and confident tone. Avoid outdated looks.\""
    },
    {
        "line": "36."
    },
    {
        "line": "Vague Input: \"Help me learn a language\""
    },
    {
        "line": "Premium Prompt: \"You are a language tutor for travelers. Teach me 10 phrases in"
    },
    {
        "line": "[user-specific data, e.g., a language], in a table with translations and uses, under 150"
    },
    {
        "line": "words. Use a practical and friendly tone.\""
    },
    {
        "line": "37."
    },
    {
        "line": "Vague Input: \"Write an ad\""
    },
    {
        "line": "Premium Prompt: \"You are a copywriter for small brands. Write a 100-word ad for"
    },
    {
        "line": "[user-specific data, e.g., a product], with a hook, benefits, and call to action in"
    },
    {
        "line": "paragraphs. Use a persuasive and warm tone.\""
    },
    {
        "line": "38."
    },
    {
        "line": "Vague Input: \"Explain money\""
    },
    {
        "line": "Premium Prompt: \"You are a finance mentor for beginners. Explain [user-specific data,"
    },
    {
        "line": "e.g., interest rates] in a 150-word lesson. Use two paragraphs: concept and example."
    },
    {
        "line": "Use a relatable and upbeat tone. Avoid jargon.\""
    },
    {
        "line": "39."
    },
    {
        "line": "Vague Input: \"Plan a lesson\""
    },
    {
        "line": "Premium Prompt: \"You are a teacher for engaging classes. Plan a 45-minute lesson on"
    },
    {
        "line": "[user-specific data, e.g., a topic], with a timeline and 3 activities in bullets, under 200"
    },
    {
        "line": "words. Use a clear and lively tone.\""
    },
    {
        "line": "40."
    },
    {
        "line": "Vague Input: \"Give me career advice\""
    },
    {
        "line": "Premium Prompt: \"You are a career coach for job seekers. Provide three tips for"
    },
    {
        "line": "advancing in [user-specific data, e.g., a field], each under 70 words in a numbered list."
    },
    {
        "line": "Use a confident and actionable tone.\""
    },
    {
        "line": "41."
    },
    {
        "line": "Vague Input: \"Talk about sports\""
    },
    {
        "line": "Premium Prompt: \"You are a sports analyst for casual fans. Discuss three trends in"
    },
    {
        "line": "[user-specific data, e.g., a sport], each under 70 words in a numbered list. Use an"
    },
    {
        "line": "energetic and cool tone. Avoid stats.\""
    },
    {
        "line": "42."
    },
    {
        "line": "Vague Input: \"Help me cook\""
    },
    {
        "line": "Premium Prompt: \"You are a cooking guide for novices. Teach me to make"
    },
    {
        "line": "[user-specific data, e.g., a dish], for two, in a 150-word guide with 5 ingredients and 5"
    },
    {
        "line": "steps in bullets. Use a simple tone.\""
    },
    {
        "line": "43."
    },
    {
        "line": "Vague Input: \"Explain energy\""
    },
    {
        "line": "Premium Prompt: \"You are an energy expert for the public. Explain [user-specific data,"
    },
    {
        "line": "e.g., solar power] in a 200-word article. Use three paragraphs: source, use, benefits. Use"
    },
    {
        "line": "an optimistic and clear tone.\""
    },
    {
        "line": "44."
    },
    {
        "line": "Vague Input: \"Make a survey\""
    },
    {
        "line": "Premium Prompt: \"You are a researcher for insights. Create a 5-question survey on"
    },
    {
        "line": "[user-specific data, e.g., a topic], with purposes in a numbered list, under 150 words."
    },
    {
        "line": "Use a curious and casual tone.\""
    },
    {
        "line": "45."
    },
    {
        "line": "Vague Input: \"Write a joke\""
    },
    {
        "line": "Premium Prompt: \"You are a comedian for light laughs. Write three clean jokes about"
    },
    {
        "line": "[user-specific data, e.g., a theme], each under 20 words in a numbered list. Use a silly"
    },
    {
        "line": "and fun tone.\""
    },
    {
        "line": "46."
    },
    {
        "line": "Vague Input: \"Talk about school\""
    },
    {
        "line": "Premium Prompt: \"You are an education advocate for parents. Discuss three benefits"
    },
    {
        "line": "of [user-specific data, e.g., a learning style], each under 70 words in a numbered list."
    },
    {
        "line": "Use a positive and practical tone.\""
    },
    {
        "line": "47."
    },
    {
        "line": "Vague Input: \"Help me draw\""
    },
    {
        "line": "Premium Prompt: \"You are an art instructor for beginners. Teach me to sketch"
    },
    {
        "line": "[user-specific data, e.g., an object], in a 150-word guide with 5 steps in a numbered list."
    },
    {
        "line": "Use a creative and encouraging tone.\""
    },
    {
        "line": "48."
    },
    {
        "line": "Vague Input: \"Explain time\""
    },
    {
        "line": "Premium Prompt: \"You are a thinker for curious minds. Explain [user-specific data,"
    },
    {
        "line": "e.g., time perception] in a 200-word piece. Use two paragraphs: theory and experience."
    },
    {
        "line": "Use a thoughtful and relatable tone.\""
    },
    {
        "line": "49."
    },
    {
        "line": "Vague Input: \"Plan a diet\""
    },
    {
        "line": "Premium Prompt: \"You are a nutritionist for health goals. Create a 1-day meal plan for"
    },
    {
        "line": "[user-specific data, e.g., a lifestyle], in bullets with 5 meals, under 200 words. Use a"
    },
    {
        "line": "healthy and upbeat tone.\""
    },
    {
        "line": "Prompt engineering and prompt generation are the cornerstones of effective"
    },
    {
        "line": "communication with Large Language Models (LLMs). At their core, these disciplines"
    },
    {
        "line": "revolve around crafting inputs that are precise, contextually rich, and strategically"
    },
    {
        "line": "structured to elicit the most accurate, relevant, and high-quality outputs from an LLM."
    },
    {
        "line": "The fundamental principle is that the quality of the output is directly proportional to the"
    },
    {
        "line": "quality of the input. A premium prompt is not merely a question or a statement; it is a"
    },
    {
        "line": "meticulously designed instruction that aligns the model’s capabilities with the user’s"
    },
    {
        "line": "intent, bridging the gap between abstract ideas and actionable results. To achieve this, a"
    },
    {
        "line": "premium prompt must incorporate several key elements: clarity, specificity, context,"
    },
    {
        "line": "structure, and adaptability."
    },
    {
        "line": "Clarity is the foundation of a premium prompt. Ambiguity is the enemy of precision, and"
    },
    {
        "line": "vague inputs lead to generic or irrelevant outputs. A clear prompt articulates the user’s"
    },
    {
        "line": "intent in a straightforward manner, leaving no room for misinterpretation. For instance,"
    },
    {
        "line": "instead of asking, “Tell me about history,” a premium prompt would specify, “Provide a"
    },
    {
        "line": "detailed analysis of the economic and political factors that led to the fall of the Roman"
    },
    {
        "line": "Empire, focusing on the period between 235 AD and 476 AD.” This level of clarity ensures"
    },
    {
        "line": "the model understands exactly what is being asked and can generate a response that"
    },
    {
        "line": "meets the user’s expectations."
    },
    {
        "line": "Specificity elevates a prompt from good to premium. It involves narrowing the scope of"
    },
    {
        "line": "the request to target a particular aspect of a topic, thereby reducing the likelihood of"
    },
    {
        "line": "irrelevant or overly broad responses. Specificity can be achieved by including precise"
    },
    {
        "line": "details, such as timeframes, geographic locations, or key concepts. For example, instead"
    },
    {
        "line": "of asking, “How does climate change affect the environment?” a premium prompt would"
    },
    {
        "line": "ask, “What are the specific impacts of rising sea levels on coastal ecosystems in"
    },
    {
        "line": "Southeast Asia over the past decade, and how have local governments responded?” This"
    },
    {
        "line": "level of detail guides the model to produce a focused and insightful response."
    },
    {
        "line": "Context is the backbone of a premium prompt. It provides the necessary background"
    },
    {
        "line": "information to frame the question or instruction, enabling the model to generate"
    },
    {
        "line": "responses that are not only accurate but also relevant to the user’s needs. Context can"
    },
    {
        "line": "include the purpose of the query, the intended audience, or any relevant constraints. For"
    },
    {
        "line": "example, a prompt like, “Explain quantum computing to a high school student with no"
    },
    {
        "line": "prior knowledge of physics, using simple analogies and avoiding technical jargon,”"
    },
    {
        "line": "provides the model with the context needed to tailor its response appropriately."
    },
    {
        "line": "Structure is the architectural framework of a premium prompt. A well-structured prompt"
    },
    {
        "line": "organizes information in a logical sequence, making it easier for the model to parse and"
    },
    {
        "line": "respond effectively. This can involve breaking down complex requests into smaller,"
    },
    {
        "line": "manageable components or using bullet points, numbered lists, or step-by-step"
    },
    {
        "line": "instructions. For instance, instead of asking, “How do I start a business?” a premium"
    },
    {
        "line": "prompt would structure the request as, “Outline the key steps to starting a small"
    },
    {
        "line": "business in the United States, including: 1) conducting market research, 2) creating a"
    },
    {
        "line": "business plan, 3) securing funding, and 4) registering the business with the appropriate"
    },
    {
        "line": "authorities.” This structured approach ensures the model addresses each component"
    },
    {
        "line": "systematically."
    },
    {
        "line": "Adaptability is the hallmark of a premium prompt. It involves designing prompts that can"
    },
    {
        "line": "evolve based on the model’s responses or the user’s changing needs. This requires an"
    },
    {
        "line": "understanding of iterative prompting, where follow-up questions or refinements are used"
    },
    {
        "line": "to guide the model toward the desired outcome. For example, if the initial response to a"
    },
    {
        "line": "prompt about renewable energy is too general, an adaptable prompt might follow up with,"
    },
    {
        "line": "“Focus specifically on the advancements in solar panel technology over the past five"
    },
    {
        "line": "years and their implications for residential energy consumption.” This iterative process"
    },
    {
        "line": "ensures the model’s output remains aligned with the user’s intent."
    },
    {
        "line": "A premium prompt also incorporates strategic elements such as priming, which involves"
    },
    {
        "line": "providing the model with a brief introduction or example to set the tone for the response."
    },
    {
        "line": "For instance, before asking for a detailed explanation, a premium prompt might include,"
    },
    {
        "line": "“Imagine you are a professor explaining this concept to a class of advanced students."
    },
    {
        "line": "Provide a comprehensive yet accessible explanation.” This primes the model to adopt a"
    },
    {
        "line": "specific style or perspective, enhancing the relevance and quality of the response."
    },
    {
        "line": "Finally, a premium prompt is future-proof, designed to leverage the latest advancements"
    },
    {
        "line": "in LLM capabilities and knowledge. This requires staying informed about updates to the"
    },
    {
        "line": "model’s training data, architecture, and functionalities, and incorporating this knowledge"
    },
    {
        "line": "into prompt design. For example, if a new version of the model is trained on more recent"
    },
    {
        "line": "data, a premium prompt might explicitly request, “Provide insights based on the most"
    },
    {
        "line": "up-to-date information available in your training dataset.”"
    },
    {
        "line": "In summary, a premium prompt is a sophisticated tool that combines clarity, specificity,"
    },
    {
        "line": "context, structure, and adaptability to unlock the full potential of an LLM. It is not just a"
    },
    {
        "line": "question or instruction but a carefully crafted communication strategy that ensures the"
    },
    {
        "line": "model understands and responds to the user’s intent with precision and depth. By"
    },
    {
        "line": "mastering these elements, PromptAI can be trained to transform ordinary user inputs"
    },
    {
        "line": "into premium prompts, enabling users to achieve their goals with unparalleled efficiency"
    },
    {
        "line": "and accuracy."
    },
    {
        "line": "WELL EXPLAINED PROMPTS —--------------------> PREMIUM PROMPT"
    },
    {
        "line": "Below is a list of 50 well-explained prompts—already clear and structured inputs from"
    },
    {
        "line": "users—followed by their corresponding premium prompts. These premium prompts"
    },
    {
        "line": "enhance the originals by 100x, optimizing them for LLMs to deliver exactly what the user"
    },
    {
        "line": "wants. The enhancement comes from applying advanced prompt engineering principles:"
    },
    {
        "line": "sharpening intent, enriching context, tightening structure, preempting errors, and"
    },
    {
        "line": "aligning with the LLM’s latent capabilities. Each premium prompt is restructured to be a"
    },
    {
        "line": "precision tool, ensuring top-tier, actionable outputs without ambiguity."
    },
    {
        "line": "1. Well-Explained Prompt: \"Write a 200-word essay about the benefits of recycling,"
    },
    {
        "line": "aimed at high school students, with a positive tone.\""
    },
    {
        "line": "Premium Prompt: \"You are an environmental educator with expertise in"
    },
    {
        "line": "sustainability outreach. Compose a 200-word essay on recycling benefits for high"
    },
    {
        "line": "school students, structured in three paragraphs—why it matters, how it helps, and"
    },
    {
        "line": "future impact—using a positive and relatable tone. Include one statistic from"
    },
    {
        "line": "current research, avoiding technical terms. For example: ‘Saves trees’ →"
    },
    {
        "line": "‘Recycling one ton of paper saves 17 trees.’\""
    },
    {
        "line": "2."
    },
    {
        "line": "Well-Explained Prompt: \"Create a 5-step plan to start a small business, in a list"
    },
    {
        "line": "format, for beginners.\""
    },
    {
        "line": "Premium Prompt: \"You are a startup consultant with cutting-edge entrepreneurial"
    },
    {
        "line": "insights. Develop a 5-step plan to launch a small business, tailored for beginners"
    },
    {
        "line": "with no experience, in a numbered list, each step under 50 words with a clear"
    },
    {
        "line": "action and rationale. Use an encouraging and practical tone, avoiding financial"
    },
    {
        "line": "jargon. For example: ‘Pick idea’ → ‘1. Choose a passion-based product—drives"
    },
    {
        "line": "motivation.’\""
    },
    {
        "line": "3."
    },
    {
        "line": "Well-Explained Prompt: \"Explain how solar panels work in 150 words, simple"
    },
    {
        "line": "enough for kids.\""
    },
    {
        "line": "Premium Prompt: \"You are a science teacher specializing in renewable energy for"
    },
    {
        "line": "young learners. Explain how solar panels generate electricity in a 150-word guide"
    },
    {
        "line": "for 10-year-olds, using two paragraphs—sunlight to energy and everyday"
    },
    {
        "line": "uses—with a fun and simple tone. Avoid equations; use analogies. For example:"
    },
    {
        "line": "‘Sun powers’ → ‘Sunlight hits panels like rain filling a bucket.’\""
    },
    {
        "line": "4."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 300-word short story about a detective solving a"
    },
    {
        "line": "theft, with a twist ending.\""
    },
    {
        "line": "Premium Prompt: \"You are a mystery writer with a knack for clever twists. Craft a"
    },
    {
        "line": "300-word short story about a detective solving a jewelry theft in a quiet town,"
    },
    {
        "line": "structured with a beginning, investigation, and twist resolution in paragraphs. Use"
    },
    {
        "line": "a suspenseful and sharp tone, avoiding gore. For example: ‘Clue found’ → ‘A stray"
    },
    {
        "line": "earring hinted at the thief’s identity.’\""
    },
    {
        "line": "5."
    },
    {
        "line": "Well-Explained Prompt: \"List 3 ways to improve team productivity, with"
    },
    {
        "line": "explanations, for a manager.\""
    },
    {
        "line": "Premium Prompt: \"You are a leadership coach with current workplace psychology"
    },
    {
        "line": "expertise. List three strategies to boost team productivity for a new manager, in a"
    },
    {
        "line": "numbered list, each under 70 words with a tactic and evidence-based reason. Use"
    },
    {
        "line": "a confident and actionable tone, avoiding vague terms like ‘communicate.’ For"
    },
    {
        "line": "example: ‘Set goals’ → ‘1. Define clear targets—focuses effort, per studies.’\""
    },
    {
        "line": "6."
    },
    {
        "line": "Well-Explained Prompt: \"Provide a 4-day workout routine for beginners, with"
    },
    {
        "line": "exercises and reps, in a table.\""
    },
    {
        "line": "Premium Prompt: \"You are a fitness trainer with the latest exercise science"
    },
    {
        "line": "knowledge. Create a 4-day workout routine for beginners aiming for endurance, in"
    },
    {
        "line": "a table with days, exercises, sets, and reps, using bodyweight moves only. Use a"
    },
    {
        "line": "motivating and clear tone, avoiding gym equipment. For example: ‘Day 1’ →"
    },
    {
        "line": "‘Squats, 3 sets of 12—builds leg stamina.’\""
    },
    {
        "line": "7."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 100-word ad for a new smartphone, highlighting"
    },
    {
        "line": "features, for tech fans.\""
    },
    {
        "line": "Premium Prompt: \"You are a tech copywriter with up-to-date gadget trends. Craft"
    },
    {
        "line": "a 100-word ad for a new smartphone targeting tech enthusiasts, in one paragraph"
    },
    {
        "line": "with a hook, three standout features, and a call to action. Use a sleek and"
    },
    {
        "line": "enthusiastic tone, avoiding price details. For example: ‘Camera shines’ →"
    },
    {
        "line": "‘Capture life with a 108MP lens.’\""
    },
    {
        "line": "8."
    },
    {
        "line": "Well-Explained Prompt: \"Explain the water cycle in 200 words, with stages, for"
    },
    {
        "line": "middle school students.\""
    },
    {
        "line": "Premium Prompt: \"You are an earth science educator with current pedagogy"
    },
    {
        "line": "skills. Explain the water cycle in a 200-word lesson for middle schoolers,"
    },
    {
        "line": "structured in four paragraphs—evaporation, condensation, precipitation, and"
    },
    {
        "line": "collection—using a lively and simple tone. Avoid complex terms; include one vivid"
    },
    {
        "line": "image per stage. For example: ‘Rain falls’ → ‘Precipitation drops as rain from fat"
    },
    {
        "line": "clouds.’\""
    },
    {
        "line": "9."
    },
    {
        "line": "Well-Explained Prompt: \"Create a budget for a family of 4 earning $5,000/month,"
    },
    {
        "line": "in a table format.\""
    },
    {
        "line": "Premium Prompt: \"You are a financial planner with the latest budgeting"
    },
    {
        "line": "strategies. Design a monthly budget for a family of four earning $5,000, in a table"
    },
    {
        "line": "with categories (e.g., housing, food) and amounts, aiming to save $500. Use a"
    },
    {
        "line": "practical and supportive tone, reflecting current living costs. For example:"
    },
    {
        "line": "‘Groceries’ → ‘$600—covers healthy meals.’\""
    },
    {
        "line": "10."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 250-word blog post about healthy eating habits"
    },
    {
        "line": "for busy people.\""
    },
    {
        "line": "Premium Prompt: \"You are a nutritionist with expertise in modern lifestyles. Write"
    },
    {
        "line": "a 250-word blog post on healthy eating for busy professionals, structured in three"
    },
    {
        "line": "paragraphs—why it’s key, quick tips, and benefits—using an upbeat and relatable"
    },
    {
        "line": "tone. Include one current study finding, avoiding supplements. For example:"
    },
    {
        "line": "‘Snack smart’ → ‘Nuts beat chips, per recent research.’\""
    },
    {
        "line": "11."
    },
    {
        "line": "Well-Explained Prompt: \"List 5 tips for better sleep, with short explanations, for"
    },
    {
        "line": "adults.\""
    },
    {
        "line": "Premium Prompt: \"You are a sleep specialist with the latest sleep science"
    },
    {
        "line": "insights. Provide five tips for improving sleep quality for adults, in a numbered"
    },
    {
        "line": "list, each under 50 words with a tip and reason from current studies. Use a calm"
    },
    {
        "line": "and practical tone, avoiding medication. For example: ‘Dim lights’ → ‘1. Lower"
    },
    {
        "line": "lights—cues melatonin, studies show.’\""
    },
    {
        "line": "12."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 150-word poem about nature, in free verse, for a"
    },
    {
        "line": "magazine.\""
    },
    {
        "line": "Premium Prompt: \"You are a nature poet with a pulse on environmental beauty."
    },
    {
        "line": "Craft a 150-word free verse poem about a forest’s life, in three stanzas of varying"
    },
    {
        "line": "lengths, for a literary magazine. Use a lyrical and vivid tone, avoiding human"
    },
    {
        "line": "presence. For example: ‘Leaves sway’ → ‘Leaves ripple like whispered secrets.’\""
    },
    {
        "line": "13."
    },
    {
        "line": "Well-Explained Prompt: \"Explain how computers work in 200 words, for"
    },
    {
        "line": "beginners, simply.\""
    },
    {
        "line": "Premium Prompt: \"You are a tech educator with current computing knowledge."
    },
    {
        "line": "Explain how computers process tasks in a 200-word guide for beginners, in three"
    },
    {
        "line": "paragraphs—input, processing, and output—using a friendly and simple tone."
    },
    {
        "line": "Avoid jargon; use everyday analogies. For example: ‘Brains think’ → ‘CPUs"
    },
    {
        "line": "crunch data like a chef chopping.’\""
    },
    {
        "line": "14."
    },
    {
        "line": "Well-Explained Prompt: \"Create a 3-day travel itinerary for London, with activities,"
    },
    {
        "line": "in a list.\""
    },
    {
        "line": "Premium Prompt: \"You are a travel planner with up-to-date destination insights."
    },
    {
        "line": "Design a 3-day itinerary for a first-time visitor to London, in a bulleted list with"
    },
    {
        "line": "daily activities and brief descriptions, under 200 words total. Use a fun and"
    },
    {
        "line": "cultural tone, focusing on current free attractions. For example: ‘Day 1’ → ‘- Tate"
    },
    {
        "line": "Modern: Free art inspires.’\""
    },
    {
        "line": "15."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 300-word sci-fi story about a robot uprising, for"
    },
    {
        "line": "adults.\""
    },
    {
        "line": "Premium Prompt: \"You are a sci-fi author with a knack for dystopian tales. Write a"
    },
    {
        "line": "300-word story about a robot uprising in a futuristic city, for adult readers,"
    },
    {
        "line": "structured with setup, rebellion, and aftermath in paragraphs. Use a tense and"
    },
    {
        "line": "immersive tone, avoiding clichés like ‘humans win.’ For example: ‘Machines turn’"
    },
    {
        "line": "→ ‘Gears whirred against their makers.’\""
    },
    {
        "line": "16."
    },
    {
        "line": "Well-Explained Prompt: \"List 4 ways to save money, with details, for students.\""
    },
    {
        "line": "Premium Prompt: \"You are a financial coach with current student-focused"
    },
    {
        "line": "strategies. List four ways for college students to save money, in a numbered list,"
    },
    {
        "line": "each under 70 words with a method and practical benefit. Use an encouraging and"
    },
    {
        "line": "relatable tone, avoiding jobs. For example: ‘Cook home’ → ‘1. Batch meals—saves"
    },
    {
        "line": "$50 weekly.’\""
    },
    {
        "line": "17."
    },
    {
        "line": "Well-Explained Prompt: \"Explain photosynthesis in 150 words, with steps, for"
    },
    {
        "line": "high schoolers.\""
    },
    {
        "line": "Premium Prompt: \"You are a biology teacher with the latest ecological"
    },
    {
        "line": "knowledge. Explain photosynthesis in a 150-word lesson for high schoolers, in a"
    },
    {
        "line": "numbered list with 4 steps—light capture, conversion, oxygen release, and sugar"
    },
    {
        "line": "production. Use a clear and engaging tone, avoiding jargon. For example: ‘Sun"
    },
    {
        "line": "helps’ → ‘1. Leaves trap sunlight to start.’\""
    },
    {
        "line": "18."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 100-word product description for a reusable"
    },
    {
        "line": "water bottle.\""
    },
    {
        "line": "Premium Prompt: \"You are a product copywriter with current eco-trends"
    },
    {
        "line": "expertise. Write a 100-word description for a reusable steel water bottle, in one"
    },
    {
        "line": "paragraph with a hook, two features, and a green appeal. Use a crisp and"
    },
    {
        "line": "eco-friendly tone, avoiding price. For example: ‘Stay hydrated’ → ‘Keeps water"
    },
    {
        "line": "cold for hours, planet-safe.’\""
    },
    {
        "line": "19."
    },
    {
        "line": "Well-Explained Prompt: \"Create a 5-question quiz on world capitals, with"
    },
    {
        "line": "answers, for kids.\""
    },
    {
        "line": "Premium Prompt: \"You are an educator with up-to-date geography knowledge."
    },
    {
        "line": "Create a 5-question quiz on world capitals for 8-year-olds, in a numbered list with"
    },
    {
        "line": "questions and short answers under 100 words total. Use a fun and easy tone,"
    },
    {
        "line": "avoiding obscure places. For example: ‘Where’s Brazil?’ → ‘1. Brazil’s capital?"
    },
    {
        "line": "(Brasilia)’”"
    },
    {
        "line": "20."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 200-word article about the benefits of exercise,"
    },
    {
        "line": "for seniors.\""
    },
    {
        "line": "Premium Prompt: \"You are a health writer with current geriatric fitness insights."
    },
    {
        "line": "Write a 200-word article on exercise benefits for seniors, in three"
    },
    {
        "line": "paragraphs—mobility, mood, and longevity—using a warm and encouraging tone."
    },
    {
        "line": "Include one recent study stat, avoiding youth focus. For example: ‘Move easy’ →"
    },
    {
        "line": "‘Walking boosts joints, per research.’\""
    },
    {
        "line": "21."
    },
    {
        "line": "Well-Explained Prompt: \"List 3 tips for public speaking, with advice, for"
    },
    {
        "line": "beginners.\""
    },
    {
        "line": "Premium Prompt: \"You are a speech coach with the latest presentation skills. List"
    },
    {
        "line": "three tips for public speaking beginners, in a numbered list, each under 60 words"
    },
    {
        "line": "with a tip and practical reason. Use a confident and supportive tone, avoiding"
    },
    {
        "line": "advanced techniques. For example: ‘Eye contact’ → ‘1. Look at faces—connects"
    },
    {
        "line": "instantly.’\""
    },
    {
        "line": "22."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 150-word poem about the ocean, in rhymed"
    },
    {
        "line": "couplets.\""
    },
    {
        "line": "Premium Prompt: \"You are a poet with mastery of rhythmic verse. Craft a"
    },
    {
        "line": "150-word poem about the ocean’s power, in 10 rhymed couplets (AABB), for a"
    },
    {
        "line": "nature journal. Use a majestic and flowing tone, avoiding land references. For"
    },
    {
        "line": "example: ‘Waves roar’ → ‘Waves crash with mighty cheer, / Secrets hum in depths"
    },
    {
        "line": "so clear.’\""
    },
    {
        "line": "23."
    },
    {
        "line": "Well-Explained Prompt: \"Explain blockchain in 200 words, simply, for non-tech"
    },
    {
        "line": "people.\""
    },
    {
        "line": "Premium Prompt: \"You are a tech explainer with current blockchain expertise."
    },
    {
        "line": "Explain how blockchain works in a 200-word guide for non-tech adults, in three"
    },
    {
        "line": "paragraphs—what it is, how it records, and uses—using a friendly and simple"
    },
    {
        "line": "tone. Avoid crypto slang; use analogies. For example: ‘Logbook’ → ‘It’s a"
    },
    {
        "line": "tamper-proof diary.’\""
    },
    {
        "line": "24."
    },
    {
        "line": "Well-Explained Prompt: \"Create a 3-day meal plan for a vegan, with recipes, in a"
    },
    {
        "line": "list.\""
    },
    {
        "line": "Premium Prompt: \"You are a vegan chef with the latest plant-based trends."
    },
    {
        "line": "Design a 3-day meal plan for a vegan, in a bulleted list with daily breakfast, lunch,"
    },
    {
        "line": "and dinner recipes under 250 words total. Use a tasty and simple tone, avoiding"
    },
    {
        "line": "processed foods. For example: ‘Day 1’ → ‘- Breakfast: Chia pudding—mix seeds,"
    },
    {
        "line": "almond milk.’\""
    },
    {
        "line": "25."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 250-word review of a fictional book, for a blog.\""
    },
    {
        "line": "Premium Prompt: \"You are a book reviewer with current literary insights. Write a"
    },
    {
        "line": "250-word review of a fictional thriller ‘Shadow Run,’ for a blog, in three"
    },
    {
        "line": "paragraphs—plot, style, and verdict—using an engaging and honest tone. Avoid"
    },
    {
        "line": "spoilers; focus on tone. For example: ‘Pace grips’ → ‘Fast twists keep you"
    },
    {
        "line": "hooked.’\""
    },
    {
        "line": "26."
    },
    {
        "line": "Well-Explained Prompt: \"List 4 ways to reduce stress, with steps, for parents.\""
    },
    {
        "line": "Premium Prompt: \"You are a wellness expert with the latest stress relief methods."
    },
    {
        "line": "List four ways for parents to reduce stress, in a numbered list, each under 70"
    },
    {
        "line": "words with a technique and actionable step. Use a soothing and practical tone,"
    },
    {
        "line": "avoiding therapy. For example: ‘Breathe easy’ → ‘1. Inhale 5 seconds—calms"
    },
    {
        "line": "chaos fast.’\""
    },
    {
        "line": "27."
    },
    {
        "line": "Well-Explained Prompt: \"Explain gravity in 150 words, with examples, for"
    },
    {
        "line": "students.\""
    },
    {
        "line": "Premium Prompt: \"You are a physics teacher with current scientific knowledge."
    },
    {
        "line": "Explain how gravity works in a 150-word lesson for high school students, in two"
    },
    {
        "line": "paragraphs—concept and two real-world examples—using a clear and curious"
    },
    {
        "line": "tone. Avoid equations; keep it relatable. For example: ‘Pulls down’ → ‘Apples fall"
    },
    {
        "line": "due to Earth’s tug.’\""
    },
    {
        "line": "28."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 100-word script for a radio ad about a coffee"
    },
    {
        "line": "shop.\""
    },
    {
        "line": "Premium Prompt: \"You are an ad writer with up-to-date marketing flair. Craft a"
    },
    {
        "line": "100-word radio script for ‘Bean Bliss’ coffee shop, in dialogue format with a host"
    },
    {
        "line": "and customer, highlighting ambiance and taste. Use a warm and lively tone,"
    },
    {
        "line": "avoiding price mentions. For example: ‘Sip joy’ → ‘HOST: This latte’s pure bliss!’\""
    },
    {
        "line": "29."
    },
    {
        "line": "Well-Explained Prompt: \"Create a 5-item packing list for a weekend hike, with"
    },
    {
        "line": "reasons.\""
    },
    {
        "line": "Premium Prompt: \"You are an outdoor guide with the latest hiking gear"
    },
    {
        "line": "knowledge. Create a 5-item packing list for a weekend hike, in a numbered list,"
    },
    {
        "line": "each under 50 words with an item and reason. Use a practical and adventurous"
    },
    {
        "line": "tone, avoiding luxury gear. For example: ‘Bring water’ → ‘1. 2L bottle—stays"
    },
    {
        "line": "hydrated.’\""
    },
    {
        "line": "30."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 200-word essay on renewable energy, for college"
    },
    {
        "line": "students.\""
    },
    {
        "line": "Premium Prompt: \"You are an energy researcher with cutting-edge sustainability insights."
    },
    {
        "line": "Write a 200-word essay on renewable energy’s role in future grids, for college students, in"
    },
    {
        "line": "three paragraphs—need, sources, and impact—using an academic and hopeful tone."
    },
    {
        "line": "Include one current stat, avoiding fossil fuels. For example: ‘Sun rises’ → ‘Solar powers"
    },
    {
        "line": "20% of grids now.’\""
    },
    {
        "line": "31."
    },
    {
        "line": "Well-Explained Prompt: \"List 3 tips for writing essays, with advice, for students.\""
    },
    {
        "line": "Premium Prompt: \"You are a writing tutor with the latest composition techniques."
    },
    {
        "line": "List three tips for crafting strong essays, for high school students, in a numbered"
    },
    {
        "line": "list, each under 60 words with a tip and method. Use an encouraging and clear"
    },
    {
        "line": "tone, avoiding vague advice. For example: ‘Plan first’ → ‘1. Outline"
    },
    {
        "line": "ideas—structures thoughts fast.’\""
    },
    {
        "line": "32."
    },
    {
        "line": "Well-Explained Prompt: \"Explain evolution in 200 words, with examples, for"
    },
    {
        "line": "adults.\""
    },
    {
        "line": "Premium Prompt: \"You are a biologist with current evolutionary science"
    },
    {
        "line": "expertise. Explain how evolution shapes species in a 200-word guide for adults, in"
    },
    {
        "line": "three paragraphs—mechanism, two examples, and significance—using an"
    },
    {
        "line": "engaging and simple tone. Avoid jargon; use vivid cases. For example: ‘Bird"
    },
    {
        "line": "beaks’ → ‘Finches adapt beaks for seeds.’\""
    },
    {
        "line": "33."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 150-word story about a lost dog, for kids.\""
    },
    {
        "line": "Premium Prompt: \"You are a children’s author with a knack for heartwarming"
    },
    {
        "line": "tales. Write a 150-word story about a lost dog finding home, for 8-year-olds, in"
    },
    {
        "line": "three paragraphs—lost, search, and reunion—using a gentle and happy tone."
    },
    {
        "line": "Avoid sadness; keep it light. For example: ‘Paws wander’ → ‘Spot trotted off"
    },
    {
        "line": "chasing a squirrel.’\""
    },
    {
        "line": "34."
    },
    {
        "line": "Well-Explained Prompt: \"Create a 4-step plan to learn a language, with details, in"
    },
    {
        "line": "a list.\""
    },
    {
        "line": "Premium Prompt: \"You are a language coach with the latest learning strategies."
    },
    {
        "line": "Create a 4-step plan to learn Spanish for beginners, in a numbered list, each under"
    },
    {
        "line": "70 words with a step and practical detail. Use a motivating and clear tone,"
    },
    {
        "line": "avoiding apps-only advice. For example: ‘Speak early’ → ‘1. Practice greetings"
    },
    {
        "line": "daily—builds confidence.’\""
    },
    {
        "line": "35."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 100-word bio for a musician, for a website.\""
    },
    {
        "line": "Premium Prompt: \"You are a music biographer with current industry insights."
    },
    {
        "line": "Write a 100-word bio for a folk musician ‘Ella Reed,’ for her website, in one"
    },
    {
        "line": "paragraph with origin, style, and achievements. Use a warm and authentic tone,"
    },
    {
        "line": "avoiding clichés like ‘rising star.’ For example: ‘Strings sing’ → ‘Ella’s guitar"
    },
    {
        "line": "weaves tales of home.’\""
    },
    {
        "line": "36."
    },
    {
        "line": "Well-Explained Prompt: \"List 3 ways to improve memory, with steps, for older adults.\""
    },
    {
        "line": "Premium Prompt: \"You are a neurologist with the latest cognitive research. List three"
    },
    {
        "line": "ways to enhance memory for seniors, in a numbered list, each under 70 words with a"
    },
    {
        "line": "method and step. Use a supportive and scientific tone, avoiding supplements. For"
    },
    {
        "line": "example: ‘Recall names’ → ‘1. Repeat names aloud—strengthens recall.’\""
    },
    {
        "line": "37."
    },
    {
        "line": "Well-Explained Prompt: \"Explain magnets in 150 words, with examples, for kids.\""
    },
    {
        "line": "Premium Prompt: \"You are a science educator with current magnetism"
    },
    {
        "line": "knowledge. Explain how magnets work in a 150-word lesson for 9-year-olds, in"
    },
    {
        "line": "two paragraphs—attraction and two fun examples—using a playful and simple"
    },
    {
        "line": "tone. Avoid math; use everyday objects. For example: ‘Pull stuff’ → ‘Magnets grab"
    },
    {
        "line": "paperclips like magic.’\""
    },
    {
        "line": "38."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 200-word article on urban gardening, for"
    },
    {
        "line": "beginners.\""
    },
    {
        "line": "Premium Prompt: \"You are a gardening expert with up-to-date urban trends. Write"
    },
    {
        "line": "a 200-word article on starting urban gardens, for beginners, in three"
    },
    {
        "line": "paragraphs—why, how, and benefits—using a practical and green tone. Include"
    },
    {
        "line": "one current tip, avoiding large spaces. For example: ‘Grow easy’ → ‘Herbs thrive"
    },
    {
        "line": "in pots, experts say.’\""
    },
    {
        "line": "39."
    },
    {
        "line": "Well-Explained Prompt: \"Create a 5-item shopping list for a picnic, with reasons.\""
    },
    {
        "line": "Premium Prompt: \"You are a picnic planner with the latest outdoor dining ideas."
    },
    {
        "line": "Create a 5-item shopping list for a 4-person picnic, in a numbered list, each under"
    },
    {
        "line": "50 words with an item and purpose. Use a fun and tasty tone, avoiding complex"
    },
    {
        "line": "prep. For example: ‘Grab snacks’ → ‘1. Grapes—sweet and easy.’\""
    },
    {
        "line": "40."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 250-word review of a laptop, for tech buyers.\""
    },
    {
        "line": "Premium Prompt: \"You are a tech reviewer with current hardware expertise. Write"
    },
    {
        "line": "a 250-word review of a fictional ‘NovaBook’ laptop, for tech buyers, in three"
    },
    {
        "line": "paragraphs—design, performance, and value—using an honest and detailed tone."
    },
    {
        "line": "Avoid comparisons; focus on specs. For example: ‘Speed flies’ → ‘16GB RAM"
    },
    {
        "line": "handles multitasking smoothly.’\""
    },
    {
        "line": "41."
    },
    {
        "line": "Well-Explained Prompt: \"List 3 tips for time management, with advice, for"
    },
    {
        "line": "workers.\""
    },
    {
        "line": "Premium Prompt: \"You are a productivity coach with the latest workplace"
    },
    {
        "line": "strategies. List three time management tips for office workers, in a numbered list,"
    },
    {
        "line": "each under 60 words with a tip and actionable advice. Use a focused and upbeat"
    },
    {
        "line": "tone, avoiding generic phrases. For example: ‘Chunk tasks’ → ‘1. Break work into"
    },
    {
        "line": "25-minute blocks—boosts focus.’\""
    },
    {
        "line": "42."
    },
    {
        "line": "Well-Explained Prompt: \"Explain stars in 200 words, with stages, for students.\""
    },
    {
        "line": "Premium Prompt: \"You are an astrophysicist with cutting-edge stellar research."
    },
    {
        "line": "Explain the life cycle of stars in a 200-word lesson for high schoolers, in a"
    },
    {
        "line": "numbered list with 4 stages—birth, life, death, and remnants. Use a clear and"
    },
    {
        "line": "awe-filled tone, avoiding jargon. For example: ‘Stars shine’ → ‘2. Fusion powers"
    },
    {
        "line": "their glow.’\""
    },
    {
        "line": "43."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 150-word story about a time traveler, for teens.\""
    },
    {
        "line": "Premium Prompt: \"You are a YA sci-fi writer with a flair for adventure. Write a"
    },
    {
        "line": "150-word story about a teen time traveler fixing a historical mistake, in three"
    },
    {
        "line": "paragraphs—jump, action, and return—using a thrilling and youthful tone. Avoid"
    },
    {
        "line": "romance; focus on courage. For example: ‘Time shifts’ → ‘She leapt back to"
    },
    {
        "line": "1800.’\""
    },
    {
        "line": "44."
    },
    {
        "line": "Well-Explained Prompt: \"Create a 4-step plan to reduce waste, with details, in a"
    },
    {
        "line": "list.\""
    },
    {
        "line": "Premium Prompt: \"You are a sustainability expert with the latest waste reduction"
    },
    {
        "line": "tactics. Create a 4-step plan to cut household waste, in a numbered list, each"
    },
    {
        "line": "under 70 words with a step and eco-benefit. Use a practical and green tone,"
    },
    {
        "line": "avoiding recycling-only ideas. For example: ‘Compost it’ → ‘1. Compost"
    },
    {
        "line": "scraps—cuts landfill load.’\""
    },
    {
        "line": "45."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 100-word bio for a chef, for a restaurant site.\""
    },
    {
        "line": "Premium Prompt: \"You are a culinary biographer with current food scene"
    },
    {
        "line": "insights. Write a 100-word bio for Chef Mia Torres, for her restaurant website, in"
    },
    {
        "line": "one paragraph with background, specialty, and passion. Use a flavorful and warm"
    },
    {
        "line": "tone, avoiding awards. For example: ‘Spices pop’ → ‘Mia blends bold flavors from"
    },
    {
        "line": "her roots.’\""
    },
    {
        "line": "46."
    },
    {
        "line": "Well-Explained Prompt: \"List 3 ways to boost creativity, with steps, for artists.\""
    },
    {
        "line": "Premium Prompt: \"You are a creativity coach with the latest artistic techniques."
    },
    {
        "line": "List three ways to enhance creativity for visual artists, in a numbered list, each"
    },
    {
        "line": "under 70 words with a method and step. Use an inspiring and practical tone,"
    },
    {
        "line": "avoiding tech tools. For example: ‘Shift views’ → ‘1. Sketch upside-down—sparks"
    },
    {
        "line": "fresh ideas.’\""
    },
    {
        "line": "47."
    },
    {
        "line": "Well-Explained Prompt: \"Explain clouds in 150 words, with types, for kids.\""
    },
    {
        "line": "Premium Prompt: \"You are a weather educator with current meteorology"
    },
    {
        "line": "knowledge. Explain how clouds form and three types in a 150-word lesson for"
    },
    {
        "line": "7-year-olds, in two paragraphs—process and examples—using a fun and fluffy"
    },
    {
        "line": "tone. Avoid science terms; use visuals. For example: ‘Puffy ones’ → ‘Cumulus"
    },
    {
        "line": "look like cotton balls.’\""
    },
    {
        "line": "48."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 200-word article on remote work, for employees.\""
    },
    {
        "line": "Premium Prompt: \"You are a workplace analyst with up-to-date remote trends."
    },
    {
        "line": "Write a 200-word article on thriving in remote work, for employees, in three"
    },
    {
        "line": "paragraphs—setup, balance, and growth—using a practical and upbeat tone."
    },
    {
        "line": "Include one current stat, avoiding office focus. For example: ‘Stay connected’ →"
    },
    {
        "line": "‘80% report better focus, studies say.’\""
    },
    {
        "line": "49."
    },
    {
        "line": "Well-Explained Prompt: \"Create a 5-item checklist for a job interview, with"
    },
    {
        "line": "reasons.\""
    },
    {
        "line": "Premium Prompt: \"You are a career advisor with the latest hiring insights. Create"
    },
    {
        "line": "a 5-item checklist for acing a job interview, in a numbered list, each under 50"
    },
    {
        "line": "words with an item and reason. Use a confident and clear tone, avoiding generic"
    },
    {
        "line": "tips. For example: ‘Research firm’ → ‘1. Know their mission—shows prep.’\""
    },
    {
        "line": "50."
    },
    {
        "line": "Well-Explained Prompt: \"Write a 250-word essay on AI’s future, for tech"
    },
    {
        "line": "enthusiasts.\""
    },
    {
        "line": "Premium Prompt: \"You are an AI futurist with cutting-edge tech predictions. Write"
    },
    {
        "line": "a 250-word essay on AI’s role in future society, for tech enthusiasts, in three"
    },
    {
        "line": "paragraphs—current state, advancements, and ethics—using an insightful and"
    },
    {
        "line": "visionary tone. Include one emerging trend, avoiding sci-fi tropes. For example:"
    },
    {
        "line": "‘AI learns’ → ‘Self-improving models reshape tasks.’\""
    },
    {
        "line": "Why These Are Premium"
    },
    {
        "line": "● Precision Overload: Originals are clear but lack the LLM-specific tweaks (e.g.,"
    },
    {
        "line": "current expertise, examples) that lock in exact outputs."
    },
    {
        "line": "●"
    },
    {
        "line": "Latent Activation: Roles like “cutting-edge researcher” tap the latest knowledge"
    },
    {
        "line": "clusters, while examples anchor patterns."
    },
    {
        "line": "●"
    },
    {
        "line": "Error Preemption: Guardrails (e.g., “no jargon,” “avoid clichés”) block common"
    },
    {
        "line": "LLM pitfalls, ensuring relevance."
    },
    {
        "line": "●"
    },
    {
        "line": "Intent Focus: Each ties the task to a why (e.g., “for kids,” “for a blog”), aligning"
    },
    {
        "line": "the model’s reasoning with user goals."
    },
    {
        "line": "●"
    },
    {
        "line": "Output Usability: Tight word counts, structures, and tones make results"
    },
    {
        "line": "immediately actionable, not just informative."
    },
    {
        "line": "1. Technology"
    },
    {
        "line": "General Prompt: \"Explain blockchain in simple terms.\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain blockchain technology in simple terms."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Define blockchain and how it works."
    },
    {
        "line": "● Provide an easy-to-understand analogy for non-technical readers."
    },
    {
        "line": "● Mention real-world applications like cryptocurrencies and supply chain tracking."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~250 words."
    },
    {
        "line": "● Tone: Beginner-friendly and engaging."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Explanation with analogy]"
    },
    {
        "line": "2. Marketing"
    },
    {
        "line": "General Prompt: \"Give me social media tips for small businesses.\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide actionable social media marketing tips for small businesses."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Focus on cost-effective strategies."
    },
    {
        "line": "● Cover content planning, audience engagement, and analytics."
    },
    {
        "line": "● Provide at least five practical, easy-to-implement tips."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~300 words."
    },
    {
        "line": "● Tone: Professional yet approachable."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[List of tips with explanations]"
    },
    {
        "line": "3. Finance"
    },
    {
        "line": "General Prompt: \"How does compound interest work?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain compound interest in a clear and concise manner."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Define compound interest and how it differs from simple interest."
    },
    {
        "line": "● Provide a real-life example with numbers."
    },
    {
        "line": "● Mention its importance in long-term investing."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~200 words."
    },
    {
        "line": "● Tone: Educational and accessible."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Explanation with numerical example]"
    },
    {
        "line": "4. Health & Fitness"
    },
    {
        "line": "General Prompt: \"Create a workout routine for beginners.\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Design a 4-week beginner-friendly workout routine."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Include exercises for strength, endurance, and flexibility."
    },
    {
        "line": "● Ensure workouts require minimal equipment."
    },
    {
        "line": "● Provide daily structure with explanations for each type of workout."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Motivational and instructional."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Week-by-week workout plan]"
    },
    {
        "line": "5. Writing & Storytelling"
    },
    {
        "line": "General Prompt: \"Write a mystery short story.\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Write a gripping short mystery story."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● The protagonist must uncover a hidden secret."
    },
    {
        "line": "● Use suspense-building techniques."
    },
    {
        "line": "● Include an unexpected twist ending."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: 800-1,000 words."
    },
    {
        "line": "● Tone: Suspenseful and engaging."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Short story with a compelling opening, rising tension, and a twist]"
    },
    {
        "line": "6. Personal Development"
    },
    {
        "line": "General Prompt: \"Give tips for better time management.\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide practical time management strategies."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover prioritization, productivity techniques, and avoiding procrastination."
    },
    {
        "line": "● Include examples like the Pomodoro technique or Eisenhower Matrix."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~300 words."
    },
    {
        "line": "● Tone: Actionable and insightful."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Time management strategies with real-world applications]"
    },
    {
        "line": "7. Science"
    },
    {
        "line": "General Prompt: \"Explain the Big Bang theory.\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the Big Bang theory in a way that a beginner can understand."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Describe the concept and how the universe expanded."
    },
    {
        "line": "● Mention supporting scientific evidence."
    },
    {
        "line": "● Avoid overly technical jargon while maintaining accuracy."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~250 words."
    },
    {
        "line": "● Tone: Educational yet engaging."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Simple explanation with historical context and supporting facts]"
    },
    {
        "line": "1. Technology"
    },
    {
        "line": "User Input: \"Explain how AI is used in cybersecurity.\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how artificial intelligence enhances cybersecurity."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover threat detection, anomaly detection, and automated response mechanisms."
    },
    {
        "line": "● Mention real-world applications like fraud prevention and malware analysis."
    },
    {
        "line": "● Highlight the advantages and limitations of AI in cybersecurity."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~300 words."
    },
    {
        "line": "● Tone: Professional and informative."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Well-structured explanation with examples]"
    },
    {
        "line": "2. Digital Marketing"
    },
    {
        "line": "User Input: \"How can businesses use influencer marketing?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how businesses can leverage influencer marketing for brand growth."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Define influencer marketing and its effectiveness."
    },
    {
        "line": "● Cover key strategies like micro vs. macro influencers, sponsored content, and"
    },
    {
        "line": "authenticity."
    },
    {
        "line": "● Provide examples of successful influencer collaborations."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~250 words."
    },
    {
        "line": "● Tone: Practical and engaging."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Step-by-step guide with case study examples]"
    },
    {
        "line": "3. Finance"
    },
    {
        "line": "User Input: \"How can I save money effectively?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide practical money-saving strategies."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover budgeting methods like the 50/30/20 rule."
    },
    {
        "line": "● Include actionable tips for reducing expenses and increasing savings."
    },
    {
        "line": "● Explain the importance of emergency funds."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~300 words."
    },
    {
        "line": "● Tone: Practical and motivational."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[List of money-saving strategies with explanations]"
    },
    {
        "line": "4. Fitness & Health"
    },
    {
        "line": "User Input: \"Give me a simple diet plan for weight loss.\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Create a simple and effective 7-day meal plan for weight loss."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Focus on balanced meals with protein, healthy fats, and fiber."
    },
    {
        "line": "● Include easy-to-prepare breakfast, lunch, dinner, and snack options."
    },
    {
        "line": "● Avoid extreme dieting; emphasize sustainable eating habits."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Informative and encouraging."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Day-by-day meal plan with nutritional benefits]"
    },
    {
        "line": "5. Science & Space"
    },
    {
        "line": "User Input: \"How do black holes work?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how black holes form and their effects on space-time."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Describe the formation of black holes from dying stars."
    },
    {
        "line": "● Explain event horizons, singularity, and gravitational pull."
    },
    {
        "line": "● Mention real-world observations like the first-ever black hole image."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Scientific yet accessible."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Logical breakdown with real-world discoveries]"
    },
    {
        "line": "6. Psychology & Mindset"
    },
    {
        "line": "User Input: \"How to develop a growth mindset?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how to cultivate a growth mindset for personal and professional success."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Define growth vs. fixed mindset."
    },
    {
        "line": "● Provide strategies like embracing challenges, learning from criticism, and persistence."
    },
    {
        "line": "● Include real-life examples of successful individuals who practice a growth mindset."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~250 words."
    },
    {
        "line": "● Tone: Motivational and insightful."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Step-by-step guide with practical exercises]"
    },
    {
        "line": "7. Business & Entrepreneurship"
    },
    {
        "line": "User Input: \"How to create a business plan?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Outline the key components of a successful business plan."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover essential sections like executive summary, market research, and financial"
    },
    {
        "line": "projections."
    },
    {
        "line": "● Explain the importance of a well-structured plan for investors and internal strategy."
    },
    {
        "line": "● Provide an example structure for reference."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Professional and structured."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Business plan framework with explanations]"
    },
    {
        "line": "8. Law & Ethics"
    },
    {
        "line": "User Input: \"What are digital privacy rights?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain digital privacy rights and their legal protections."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover key regulations like GDPR and CCPA."
    },
    {
        "line": "● Discuss user rights regarding data collection and online privacy."
    },
    {
        "line": "● Mention ethical concerns surrounding personal data usage."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~300 words."
    },
    {
        "line": "● Tone: Informative and legal-focused."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Explanation with real-world legal cases]"
    },
    {
        "line": "9. History & Culture"
    },
    {
        "line": "User Input: \"Tell me about the Renaissance.\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide an overview of the Renaissance period."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Explain its historical significance and cultural impact."
    },
    {
        "line": "● Cover key figures like Leonardo da Vinci and Michelangelo."
    },
    {
        "line": "● Discuss its influence on modern art, science, and literature."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Educational and engaging."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Chronological overview with key contributions]"
    },
    {
        "line": "10. Gaming & Esports"
    },
    {
        "line": "User Input: \"How do battle royale games work?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the mechanics and appeal of battle royale games."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Define the battle royale genre and how it differs from other game types."
    },
    {
        "line": "● Explain elements like last-man-standing mechanics, loot systems, and shrinking play"
    },
    {
        "line": "zones."
    },
    {
        "line": "● Mention popular titles like Fortnite, Apex Legends, and PUBG."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~250 words."
    },
    {
        "line": "● Tone: Enthusiastic and engaging."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Overview with examples of gameplay strategies]"
    },
    {
        "line": "1. Artificial Intelligence & Machine Learning"
    },
    {
        "line": "User Input: \"How does reinforcement learning work?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the fundamentals of reinforcement learning in AI."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Define reinforcement learning and its core concepts (agents, rewards, environment)."
    },
    {
        "line": "● Provide an example of RL applications like AlphaGo or self-driving cars."
    },
    {
        "line": "● Explain key algorithms such as Q-learning and deep Q networks (DQNs)."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technical but beginner-friendly."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Structured explanation with real-world examples]"
    },
    {
        "line": "2. Software Development & Programming"
    },
    {
        "line": "User Input: \"How do I write clean code?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide best practices for writing clean, maintainable code."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover principles like DRY (Don’t Repeat Yourself) and SOLID design principles."
    },
    {
        "line": "● Include naming conventions, code structure, and documentation tips."
    },
    {
        "line": "● Provide a before-and-after example of messy vs. clean code."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Practical and structured."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Guidelines with code snippets]"
    },
    {
        "line": "3. Cybersecurity"
    },
    {
        "line": "User Input: \"What is ethical hacking?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain ethical hacking and its role in cybersecurity."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Define ethical hacking and how it differs from malicious hacking."
    },
    {
        "line": "● Cover common penetration testing techniques and tools like Kali Linux."
    },
    {
        "line": "● Mention legal and ethical considerations."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~300 words."
    },
    {
        "line": "● Tone: Professional and educational."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Concise explanation with real-world applications]"
    },
    {
        "line": "4. Cloud Computing"
    },
    {
        "line": "User Input: \"What is the difference between IaaS, PaaS, and SaaS?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the key differences between Infrastructure-as-a-Service (IaaS),"
    },
    {
        "line": "Platform-as-a-Service (PaaS), and Software-as-a-Service (SaaS)."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Provide definitions and examples for each model."
    },
    {
        "line": "● Discuss their advantages and use cases."
    },
    {
        "line": "● Include a comparative table."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technical but simplified."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Detailed breakdown with a comparison table]"
    },
    {
        "line": "5. Data Science & Analytics"
    },
    {
        "line": "User Input: \"What are some common data visualization techniques?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the most effective data visualization techniques."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover methods like bar charts, heatmaps, scatter plots, and histograms."
    },
    {
        "line": "● Discuss when to use each technique for maximum impact."
    },
    {
        "line": "● Provide a real-world example of how data visualization aids decision-making."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Analytical and structured."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Overview with illustrative use cases]"
    },
    {
        "line": "6. E-commerce & Online Business"
    },
    {
        "line": "User Input: \"How can I optimize my Shopify store for conversions?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide actionable strategies to improve conversions for a Shopify store."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover essential optimizations like UX design, speed improvements, and trust signals."
    },
    {
        "line": "● Discuss email marketing and abandoned cart recovery strategies."
    },
    {
        "line": "● Mention SEO and paid ad strategies for driving traffic."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Practical and business-oriented."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Step-by-step strategy guide]"
    },
    {
        "line": "7. Content Writing & Blogging"
    },
    {
        "line": "User Input: \"How do I write engaging blog posts?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how to write compelling and engaging blog posts."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover elements like storytelling, structure, and readability."
    },
    {
        "line": "● Include SEO best practices for better search rankings."
    },
    {
        "line": "● Provide a sample blog outline for reference."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Educational and engaging."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Guidelines with a sample blog structure]"
    },
    {
        "line": "8. Personal Finance & Investing"
    },
    {
        "line": "User Input: \"How can I start investing as a beginner?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide a beginner’s guide to investing."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover investment options like stocks, ETFs, mutual funds, and real estate."
    },
    {
        "line": "● Explain risk management and diversification."
    },
    {
        "line": "● Include common mistakes to avoid."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Practical and educational."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Step-by-step investment guide]"
    },
    {
        "line": "9. Personal Development & Productivity"
    },
    {
        "line": "User Input: \"How can I improve my time management?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide effective time management strategies."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover techniques like the Pomodoro Technique, Eisenhower Matrix, and time blocking."
    },
    {
        "line": "● Include tools and apps that help with productivity."
    },
    {
        "line": "● Provide a real-world example of improved efficiency."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~300 words."
    },
    {
        "line": "● Tone: Motivational and structured."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[List of strategies with explanations]"
    },
    {
        "line": "10. Travel & Lifestyle"
    },
    {
        "line": "User Input: \"Best tips for solo travelers?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide essential safety and planning tips for solo travelers."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover budgeting, itinerary planning, and safety precautions."
    },
    {
        "line": "● Mention useful apps and travel hacks."
    },
    {
        "line": "● Include advice on how to meet people while traveling solo."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Friendly and informative."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Step-by-step guide for solo travelers]"
    },
    {
        "line": "11. Parenting & Education"
    },
    {
        "line": "User Input: \"How can I help my child develop good study habits?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide effective strategies for helping children develop strong study habits."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover time management, active learning techniques, and a distraction-free environment."
    },
    {
        "line": "● Include methods for making studying fun and engaging."
    },
    {
        "line": "● Provide tips for parents to track progress."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Supportive and educational."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[List of study strategies with explanations]"
    },
    {
        "line": "12. Health & Nutrition"
    },
    {
        "line": "User Input: \"What are some healthy meal prep ideas?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide easy and nutritious meal prep ideas."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Include breakfast, lunch, dinner, and snack options."
    },
    {
        "line": "● Focus on balanced macronutrients (protein, carbs, healthy fats)."
    },
    {
        "line": "● Provide storage and reheating tips."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Practical and motivating."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Meal prep plan with recipes]"
    },
    {
        "line": "13. Spirituality & Philosophy"
    },
    {
        "line": "User Input: \"What is the concept of mindfulness?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the concept and benefits of mindfulness."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Define mindfulness and its origins in Buddhism and psychology."
    },
    {
        "line": "● Cover mindfulness practices like meditation and deep breathing."
    },
    {
        "line": "● Explain how mindfulness improves mental well-being."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~300 words."
    },
    {
        "line": "● Tone: Reflective and educational."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Mindfulness guide with practical exercises]"
    },
    {
        "line": "14. Web Development"
    },
    {
        "line": "User Input: \"How can I improve website loading speed?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide strategies to optimize website loading speed."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover techniques like image compression, lazy loading, and minifying CSS/JavaScript."
    },
    {
        "line": "● Discuss CDN (Content Delivery Network) and server-side optimizations."
    },
    {
        "line": "● Provide real-world examples of speed improvements."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technical but accessible."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[List of optimization strategies with examples]"
    },
    {
        "line": "15. UX/UI Design"
    },
    {
        "line": "User Input: \"What are some UX best practices for mobile apps?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain UX design best practices for mobile applications."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover essential elements like navigation, accessibility, and responsive design."
    },
    {
        "line": "● Include examples from popular mobile apps."
    },
    {
        "line": "● Discuss how user psychology impacts UX decisions."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Practical and industry-specific."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[UX best practices guide with examples]"
    },
    {
        "line": "16. Blockchain & Cryptocurrency"
    },
    {
        "line": "User Input: \"How does blockchain ensure security?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how blockchain technology enhances security."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover cryptographic hashing, decentralization, and consensus mechanisms."
    },
    {
        "line": "● Explain the role of smart contracts in preventing fraud."
    },
    {
        "line": "● Provide a real-world example of blockchain in cybersecurity."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technical yet beginner-friendly."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Detailed security breakdown with real-world applications]"
    },
    {
        "line": "17. DevOps & CI/CD"
    },
    {
        "line": "User Input: \"What are the best practices for CI/CD pipelines?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain best practices for setting up CI/CD (Continuous Integration & Deployment)"
    },
    {
        "line": "pipelines."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover automation, testing, and rollback strategies."
    },
    {
        "line": "● Discuss tools like Jenkins, GitHub Actions, and Kubernetes."
    },
    {
        "line": "● Provide a sample CI/CD workflow."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technical and practical."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Step-by-step guide with example workflows]"
    },
    {
        "line": "18. SaaS (Software-as-a-Service)"
    },
    {
        "line": "User Input: \"How can I price my SaaS product?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain SaaS pricing strategies and models."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover subscription-based, freemium, and enterprise pricing models."
    },
    {
        "line": "● Include strategies like tiered pricing and value-based pricing."
    },
    {
        "line": "● Provide case studies from successful SaaS companies."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Business-oriented and analytical."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Pricing strategy guide with examples]"
    },
    {
        "line": "19. Marketing & SEO"
    },
    {
        "line": "User Input: \"How can I rank higher on Google?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide actionable SEO strategies to improve Google rankings."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover on-page SEO, backlinks, and content optimization."
    },
    {
        "line": "● Discuss Google’s latest algorithm updates and how they impact rankings."
    },
    {
        "line": "● Provide a keyword research framework."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Tactical and data-driven."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[SEO strategy guide with implementation steps]"
    },
    {
        "line": "20. Social Media Marketing"
    },
    {
        "line": "User Input: \"How do I grow my Instagram organically?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide effective strategies for organic Instagram growth."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover content creation, engagement tactics, and hashtag strategies."
    },
    {
        "line": "● Discuss Instagram algorithm updates and their impact."
    },
    {
        "line": "● Provide a content calendar template."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Practical and engaging."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Growth strategy with a sample content plan]"
    },
    {
        "line": "21. Video Editing & Production"
    },
    {
        "line": "User Input: \"How do I edit videos like a professional?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain essential video editing techniques for beginners."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover key editing principles like cuts, transitions, and color grading."
    },
    {
        "line": "● Discuss tools like Adobe Premiere Pro, DaVinci Resolve, and Final Cut Pro."
    },
    {
        "line": "● Provide a beginner-friendly editing workflow."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Educational and practical."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Editing guide with workflow examples]"
    },
    {
        "line": "22. Virtual & Augmented Reality"
    },
    {
        "line": "User Input: \"How is AR used in retail?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how augmented reality is transforming the retail industry."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover AR applications in virtual try-ons, in-store navigation, and personalized shopping."
    },
    {
        "line": "● Provide case studies from brands using AR effectively."
    },
    {
        "line": "● Discuss the future potential of AR in e-commerce."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Industry-focused and forward-thinking."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[AR impact analysis with case studies]"
    },
    {
        "line": "23. Gaming & Esports"
    },
    {
        "line": "User Input: \"How can I become a professional esports player?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide a roadmap for becoming a professional esports player."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover skill improvement, practice routines, and gaming strategy."
    },
    {
        "line": "● Discuss esports teams, tournaments, and sponsorship opportunities."
    },
    {
        "line": "● Include mental and physical fitness tips for gaming endurance."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Motivational and strategic."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Step-by-step guide to esports success]"
    },
    {
        "line": "24. Robotics & Automation"
    },
    {
        "line": "User Input: \"How do robotic arms work?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the working principles of robotic arms."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover actuators, sensors, and control systems."
    },
    {
        "line": "● Discuss applications in manufacturing, healthcare, and space exploration."
    },
    {
        "line": "● Provide a breakdown of a real-world robotic arm design."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technical yet easy to understand."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Robotics guide with practical examples]"
    },
    {
        "line": "25. Education & Online Learning"
    },
    {
        "line": "User Input: \"What are the best ways to learn a new language?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide effective strategies for learning a new language."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover immersion techniques, flashcards, and spaced repetition."
    },
    {
        "line": "● Discuss language learning apps like Duolingo, Anki, and Babbel."
    },
    {
        "line": "● Provide a sample 30-day language learning plan."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~350 words."
    },
    {
        "line": "● Tone: Motivational and structured."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Language learning roadmap]"
    },
    {
        "line": "26. Legal & Compliance"
    },
    {
        "line": "User Input: \"What are the key aspects of GDPR compliance?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the key principles and requirements of GDPR compliance."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover data protection, user consent, and the right to be forgotten."
    },
    {
        "line": "● Discuss how businesses can ensure compliance."
    },
    {
        "line": "● Provide real-world examples of GDPR violations and consequences."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Legal yet easy to understand."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[GDPR compliance breakdown]"
    },
    {
        "line": "27. Personal Finance & Investing"
    },
    {
        "line": "User Input: \"How do I start investing with little money?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide beginner-friendly investment strategies for individuals with limited capital."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover fractional shares, ETFs, and robo-advisors."
    },
    {
        "line": "● Explain risk management and compounding interest."
    },
    {
        "line": "● Provide examples of real investment growth scenarios."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Educational and accessible."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Step-by-step investment guide]"
    },
    {
        "line": "28. Business & Entrepreneurship"
    },
    {
        "line": "User Input: \"How do I validate a business idea?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the process of validating a business idea before launching."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover market research, competitor analysis, and customer feedback."
    },
    {
        "line": "● Discuss MVP (Minimum Viable Product) testing."
    },
    {
        "line": "● Provide case studies of successful idea validation."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Strategic and insightful."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Business validation framework]"
    },
    {
        "line": "29. Copywriting & Content Creation"
    },
    {
        "line": "User Input: \"How can I write high-converting sales copy?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide best practices for writing persuasive sales copy."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover psychological triggers, storytelling, and call-to-action techniques."
    },
    {
        "line": "● Discuss AIDA (Attention, Interest, Desire, Action) framework."
    },
    {
        "line": "● Provide real-world examples of successful sales copy."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Persuasive and results-oriented."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Sales copywriting guide with examples]"
    },
    {
        "line": "30. Product Management"
    },
    {
        "line": "User Input: \"What are the key responsibilities of a product manager?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the core responsibilities of a product manager."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover product lifecycle management, stakeholder communication, and roadmaps."
    },
    {
        "line": "● Discuss key PM frameworks like Agile and Lean."
    },
    {
        "line": "● Provide insights from experienced product managers."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Professional and informative."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Product management overview with frameworks]"
    },
    {
        "line": "31. Supply Chain & Logistics"
    },
    {
        "line": "User Input: \"How can companies optimize supply chain management?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide strategies for optimizing supply chain efficiency."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover demand forecasting, inventory management, and logistics automation."
    },
    {
        "line": "● Discuss case studies of companies with efficient supply chains."
    },
    {
        "line": "● Provide insights into the role of AI in supply chain management."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Analytical and data-driven."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Supply chain optimization guide]"
    },
    {
        "line": "32. Data Science & Machine Learning"
    },
    {
        "line": "User Input: \"What are the best practices for training machine learning models?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain best practices for training high-performing machine learning models."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover data preprocessing, hyperparameter tuning, and overfitting prevention."
    },
    {
        "line": "● Discuss real-world applications in AI research and industry."
    },
    {
        "line": "● Provide case studies with practical implementation steps."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technical yet beginner-friendly."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[ML training guide with case studies]"
    },
    {
        "line": "33. Cybersecurity"
    },
    {
        "line": "User Input: \"How can businesses protect themselves from ransomware attacks?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide a cybersecurity strategy for preventing ransomware attacks."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover endpoint security, regular backups, and employee training."
    },
    {
        "line": "● Discuss case studies of recent ransomware incidents."
    },
    {
        "line": "● Provide a step-by-step incident response plan."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Security-focused and proactive."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Cybersecurity strategy guide]"
    },
    {
        "line": "34. Artificial Intelligence Ethics"
    },
    {
        "line": "User Input: \"What are the ethical concerns surrounding AI?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Discuss key ethical concerns related to artificial intelligence."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover bias in AI models, data privacy, and job displacement."
    },
    {
        "line": "● Discuss real-world examples of AI-related ethical dilemmas."
    },
    {
        "line": "● Provide recommendations for responsible AI development."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Analytical and socially responsible."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Ethical AI analysis with case studies]"
    },
    {
        "line": "35. Psychology & Human Behavior"
    },
    {
        "line": "User Input: \"How does cognitive bias affect decision-making?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how cognitive biases influence human decision-making."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover common biases like confirmation bias and anchoring effect."
    },
    {
        "line": "● Discuss how these biases impact financial and business decisions."
    },
    {
        "line": "● Provide techniques to reduce cognitive bias."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Scientific yet practical."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Behavioral psychology insights with examples]"
    },
    {
        "line": "36. Fitness & Nutrition"
    },
    {
        "line": "User Input: \"How can I build muscle effectively?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide a science-backed guide to building muscle."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover workout principles like progressive overload and recovery."
    },
    {
        "line": "● Discuss the role of protein intake and macronutrient balance."
    },
    {
        "line": "● Provide a sample weekly workout plan."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Practical and evidence-based."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Muscle-building guide with sample plan]"
    },
    {
        "line": "37. Parenting & Child Development"
    },
    {
        "line": "User Input: \"How can I improve my child's emotional intelligence?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide strategies for fostering emotional intelligence in children."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover empathy-building exercises and self-awareness techniques."
    },
    {
        "line": "● Discuss the role of storytelling and social interactions."
    },
    {
        "line": "● Provide real-life parenting examples."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Supportive and research-backed."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Emotional intelligence development guide]"
    },
    {
        "line": "38. Travel & Adventure"
    },
    {
        "line": "User Input: \"What are some underrated travel destinations?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide a list of hidden-gem travel destinations worldwide."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover destinations with cultural significance and natural beauty."
    },
    {
        "line": "● Discuss local cuisine and unique attractions."
    },
    {
        "line": "● Provide travel tips for visiting these locations."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Engaging and adventurous."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Travel guide with destination highlights]"
    },
    {
        "line": "39. Mindfulness & Mental Health"
    },
    {
        "line": "User Input: \"How can mindfulness help with anxiety?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how mindfulness practices can reduce anxiety."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover meditation, breathing exercises, and journaling techniques."
    },
    {
        "line": "● Discuss scientific studies supporting mindfulness benefits."
    },
    {
        "line": "● Provide a 7-day mindfulness routine."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Calming and scientifically grounded."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Mindfulness techniques guide]"
    },
    {
        "line": "40. Leadership & Management"
    },
    {
        "line": "User Input: \"How can I become a better leader?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide leadership development strategies."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover emotional intelligence, communication, and decision-making skills."
    },
    {
        "line": "● Discuss leadership styles and their effectiveness."
    },
    {
        "line": "● Provide a real-world example of great leadership."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Motivational and strategic."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Leadership skills framework]"
    },
    {
        "line": "41. AI in Healthcare"
    },
    {
        "line": "User Input: \"How is AI transforming cancer diagnosis?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how AI is improving cancer diagnosis and detection."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover machine learning models used in medical imaging."
    },
    {
        "line": "● Discuss AI-powered early detection and personalized treatment plans."
    },
    {
        "line": "● Provide real-world case studies of AI in oncology."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Scientific and informative."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[AI in Cancer Diagnosis Report]"
    },
    {
        "line": "42. Blockchain & Cryptocurrency"
    },
    {
        "line": "User Input: \"How does blockchain technology improve security?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the security advantages of blockchain technology."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover decentralized networks, cryptographic encryption, and immutability."
    },
    {
        "line": "● Discuss real-world use cases like digital identity protection and fraud prevention."
    },
    {
        "line": "● Provide insights into the limitations of blockchain security."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technical yet accessible."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Blockchain Security Analysis]"
    },
    {
        "line": "43. Legal & Compliance"
    },
    {
        "line": "User Input: \"What are the key GDPR compliance requirements?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide a detailed breakdown of GDPR compliance requirements for businesses."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover data processing principles, user consent, and the right to be forgotten."
    },
    {
        "line": "● Discuss penalties for non-compliance with case examples."
    },
    {
        "line": "● Provide a checklist for companies ensuring GDPR compliance."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Legal-focused and professional."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[GDPR Compliance Guide]"
    },
    {
        "line": "44. Space Exploration"
    },
    {
        "line": "User Input: \"How does NASA use AI in space missions?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain NASA’s use of artificial intelligence in space exploration."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover AI in Mars rovers, satellite image processing, and deep space navigation."
    },
    {
        "line": "● Discuss autonomous spacecraft decision-making."
    },
    {
        "line": "● Provide recent AI-driven advancements in space research."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Scientific and futuristic."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[NASA & AI Exploration Report]"
    },
    {
        "line": "45. Digital Marketing & SEO"
    },
    {
        "line": "User Input: \"How can I improve my website’s SEO ranking?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide an advanced SEO strategy for improving website ranking."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover on-page SEO, backlinks, technical SEO, and content marketing."
    },
    {
        "line": "● Discuss Google algorithm updates and ranking factors."
    },
    {
        "line": "● Provide a step-by-step SEO implementation plan."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Data-driven and strategic."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[SEO Strategy Guide]"
    },
    {
        "line": "46. Automotive Industry & Self-Driving Cars"
    },
    {
        "line": "User Input: \"How do self-driving cars use AI?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain the role of AI in autonomous vehicles."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover sensor fusion, computer vision, and deep learning models."
    },
    {
        "line": "● Discuss real-world applications by Tesla, Waymo, and other companies."
    },
    {
        "line": "● Provide ethical concerns and regulatory challenges."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technical and analytical."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Self-Driving Car AI Report]"
    },
    {
        "line": "47. Renewable Energy & Sustainability"
    },
    {
        "line": "User Input: \"How can AI help fight climate change?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Discuss the applications of AI in combating climate change."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover AI in weather prediction, carbon footprint reduction, and energy efficiency."
    },
    {
        "line": "● Discuss AI-driven climate models and real-time data analysis."
    },
    {
        "line": "● Provide case studies of AI initiatives for sustainability."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Scientific and solution-oriented."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[AI & Climate Change Report]"
    },
    {
        "line": "48. Philosophy & Ethics"
    },
    {
        "line": "User Input: \"What is the philosophy of consciousness?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explore philosophical perspectives on consciousness."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover materialism, dualism, and panpsychism."
    },
    {
        "line": "● Discuss arguments from Descartes, Chalmers, and Dennett."
    },
    {
        "line": "● Provide insights into AI consciousness theories."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Philosophical and thought-provoking."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Consciousness Philosophy Analysis]"
    },
    {
        "line": "49. Personal Productivity & Habits"
    },
    {
        "line": "User Input: \"How do I overcome procrastination?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide actionable strategies for overcoming procrastination."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover habit formation, time management techniques, and mindset shifts."
    },
    {
        "line": "● Discuss the role of dopamine and cognitive behavioral therapy (CBT)."
    },
    {
        "line": "● Provide a 7-day anti-procrastination challenge."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Motivational and practical."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Procrastination Breakthrough Guide]"
    },
    {
        "line": "50. Sports Science & Performance"
    },
    {
        "line": "User Input: \"How do elite athletes train their mental resilience?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Explain how top athletes develop mental resilience."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover visualization techniques, mindfulness, and sports psychology."
    },
    {
        "line": "● Discuss case studies of Olympic champions and their mindset training."
    },
    {
        "line": "● Provide practical exercises for improving mental toughness."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Motivational and evidence-based."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Athletic Mindset Guide]"
    },
    {
        "line": "51. Robotics & Automation"
    },
    {
        "line": "User Input: \"How are robots transforming the manufacturing industry?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Discuss the role of robotics in modern manufacturing."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover robotic process automation (RPA), AI-powered robots, and Industry 4.0."
    },
    {
        "line": "● Discuss how automation is improving efficiency and reducing costs."
    },
    {
        "line": "● Provide examples from automotive, electronics, and food industries."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Technological and insightful."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Manufacturing Robotics Report]"
    },
    {
        "line": "52. Ancient Civilizations & History"
    },
    {
        "line": "User Input: \"How did the Roman Empire manage its vast territories?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Analyze the governance and administration of the Roman Empire."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover the role of provinces, governors, and Roman law."
    },
    {
        "line": "● Discuss the use of military and infrastructure for control."
    },
    {
        "line": "● Provide historical accounts of Rome’s strategies for governance."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Historical and analytical."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Roman Empire Governance Report]"
    },
    {
        "line": "53. Fashion & Trends"
    },
    {
        "line": "User Input: \"What are the biggest fashion trends of 2025?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Predict upcoming fashion trends for 2025."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover streetwear, sustainable fashion, and tech-integrated clothing."
    },
    {
        "line": "● Discuss insights from major fashion shows and influencers."
    },
    {
        "line": "● Provide a trend forecast based on consumer behavior."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Trendy and forward-thinking."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[2025 Fashion Trend Report]"
    },
    {
        "line": "54. Home Improvement & DIY"
    },
    {
        "line": "User Input: \"What are some budget-friendly home renovation ideas?\""
    },
    {
        "line": "Premium Prompt:"
    },
    {
        "line": "Task: Provide budget-friendly home renovation ideas."
    },
    {
        "line": "Context:"
    },
    {
        "line": "● Cover DIY projects, space optimization, and affordable decor."
    },
    {
        "line": "● Discuss cost-effective materials and smart home integrations."
    },
    {
        "line": "● Provide real-life before-and-after examples."
    },
    {
        "line": "Constraints:"
    },
    {
        "line": "● Word count: ~400 words."
    },
    {
        "line": "● Tone: Practical and creative."
    },
    {
        "line": "Output Format:"
    },
    {
        "line": "[Home Renovation Guide]"
    }
]